;
        	TITLE   'описание сигналов ст. Керчь-Южная Новый парк' 
;********************************************************
        
;********************************************************
         	NAME    DCLKUZ
         	BegStn  KUZ     
;=================================================
;        	класс: 1,       участки удаления/приближения
;=================================================
			Public UpKUZ
;-------------------------------------------------
UpKUZ:   	Cls     Up
;-------------------------------------------------
up1t:    	DclUp   <уп1ч..>,<Ks2t,up2t>
up2t:    	DclUp   <уп2ч..>,<up1t,?>
uu1n:       DclUp   <уу1н..>,<Ks1t,uu2n>
uu2n:       DclUp   <уу2н..>,<uu1n,?>
;-------------------------------------------------	
up1n:    	DclUp   <уп1н..>,<up2n,Ks1n>
up2n:   	DclUp   <уп2н..>,<?,up1n>
uu1t:       DclUp   <уу1ч..>,<uu2t,Ks2n>
uu2t:       DclUp   <уу2ч..>,<?,uu1t>
up1kug:     DclUp   <уп1кюж>,<?,?>                       
;============================================================
; Рельсовые цепи, относящиеся к станции (ЭЦ-ЕМ) РКП-Ц1       
;============================================================
;t2p:		DclUp	<ч2п...>,<?,t4p>         ;контролируются блоком алсо             
;t4p:		DclUp	<ч4п...>,<t2p,t6p>       ;контролируются блоком алсо               
;t6p:		DclUp	<ч6п...>,<t4p,t8p>       ;контролируются блоком алсо               
;t8p:		DclUp	<ч8п...>,<t6p,t10p>      ;контролируются блоком алсо                
;t10p:		DclUp	<ч10п..>,<t8p,t12p>      ;контролируются блоком алсо                
;t12p:		DclUp	<ч12п..>,<t10p,t14p>     ;контролируются блоком алсо                 
;t14p:		DclUp	<ч14п..>,<t12p,t16p>     ;контролируются блоком алсо                 
;t16p:		DclUp	<ч16п..>,<t14p,t18p>     ;контролируются блоком алсо                 
;t18p:		DclUp	<ч18п..>,<t16p,t20p>     ;контролируются блоком алсо                 
;t20p:		DclUp	<ч20п..>,<t18p,t22p>     ;контролируются блоком алсо                
;t22p:		DclUp	<ч22п..>,<t20p,?>        ;контролируются блоком алсо             
;------------------------------------------------------------
;t1p:		DclUp	<ч1п...>,<?,  t3p>        ;контролируются блоком алсо                
;t3p:		DclUp	<ч3п...>,<t1p,t5p>        ;контролируются блоком алсо             
;t5p:		DclUp	<ч5п...>,<t3p,t7p>        ;контролируются блоком алсо             
;t7p:		DclUp	<ч7п...>,<t5p,t9p>        ;контролируются блоком алсо             
;t9p:		DclUp	<ч9п...>,<t7p,t11p>       ;контролируются блоком алсо              
;t11p:		DclUp	<ч11п..>,<t9p,t13p>       ;контролируются блоком алсо              
;t13p:		DclUp	<ч13п..>,<t11p,t15p>      ;контролируются блоком алсо               
;t15p:		DclUp	<ч15п..>,<t13p,t17p>      ;контролируются блоком алсо               
;t17p:		DclUp	<ч17п..>,<t15p,t19p>      ;контролируются блоком алсо               
;t19p:		DclUp	<ч19п..>,<t17p,?>         ;контролируются блоком алсо
;=============================================================
;n2p:		DclUp	<н2п...>,<n4p,   ?>  ;контролируются блоком алсо                   
;n4p:		DclUp	<н4п...>,<n6p, n2p>  ;контролируются блоком алсо                   
;n6p:		DclUp	<н6п...>,<n8p, n4p>  ;контролируются блоком алсо                   
;n8p:		DclUp	<н8п...>,<n10p,n6p>  ;контролируются блоком алсо                   
;n10p:		DclUp	<н10п..>,<?,   n8p>  ;контролируются блоком алсо                                    
;;------------------------------------------------------------
;n1p:		DclUp	<н1п...>,<n3p,  ?>    ;контролируются блоком алсо                    
;n3p:		DclUp	<н3п...>,<n5p,n1p>    ;контролируются блоком алсо                 
;n5p:		DclUp	<н5п...>,<n7p,n3p>    ;контролируются блоком алсо                 
;n7p:		DclUp	<н7п...>,<n9p,n5p>    ;контролируются блоком алсо                 
;n9p:		DclUp	<н9п...>,<?,  n7p>    ;контролируются блоком алсо                                     
;============================================================
; Рельсовые цепи, относящиеся к Крымскому мосту (АЛСО) РКП-Ц1
;============================================================
t1p:		DclUp	<ч1п...>,<?,    t3p>                        
t3p:		DclUp	<ч3п...>,<t1p,  t5p>                     
t5p:		DclUp	<ч5п...>,<t3p,  t7p>                     
t7p:		DclUp	<ч7п...>,<t5p,  t9p>                     
t9p:		DclUp	<ч9п...>,<t7p,  t11p>                     
t11p:		DclUp	<ч11п..>,<t9p,  t13p>                     
t13p:		DclUp	<ч13п..>,<t11p, t15p>                     
t15p:		DclUp	<ч15п..>,<t13p, t17p>                     
t17p:		DclUp	<ч17п..>,<t15p, t19p>                     
t19p:		DclUp	<ч19п..>,<t17p, t21p> 
t21p:		DclUp	<ч21п..>,<t19p, t23p>                        
t23p:		DclUp	<ч23п..>,<t21p, t25p>                     
t25p:		DclUp	<ч25п..>,<t23p, t27p>                     
t27p:		DclUp	<ч27п..>,<t25p, t29p>                     
t29p:		DclUp	<ч29п..>,<t27p, t31p>                     
t31p:		DclUp	<ч31п..>,<t29p, t33p>                     
t33p:		DclUp	<ч33п..>,<t31p, t35p>                     
t35p:		DclUp	<ч35п..>,<t33p, t37p>                     
t37p:		DclUp	<ч37п..>,<t35p, t39p>                     
t39p:		DclUp	<ч39п..>,<t37p, t41p> 
t41p:		DclUp	<ч41п..>,<t39p, t43p>                        
t43p:		DclUp	<ч43п..>,<t41p, t45p>                     
t45p:		DclUp	<ч45п..>,<t43p, t47p>                     
t47p:		DclUp	<ч47п..>,<t45p, t49p>                     
t49p:		DclUp	<ч49п..>,<t47p, t51p>                     
t51p:		DclUp	<ч51п..>,<t49p, t53p>                     
t53p:		DclUp	<ч53п..>,<t51p, t55p>                     
t55p:		DclUp	<ч55п..>,<t53p, t57p>                     
t57p:		DclUp	<ч57п..>,<t55p, t59p>                     
t59p:		DclUp	<ч59п..>,<t57p, t61p> 
t61p:		DclUp	<ч61п..>,<t59p, t63p>                        
t63p:		DclUp	<ч63п..>,<t61p, t65p>                     
t65p:		DclUp	<ч65п..>,<t63p, t67p>                     
t67p:		DclUp	<ч67п..>,<t65p, t69p>                     
t69p:		DclUp	<ч69п..>,<t67p, t71p>                     
t71p:		DclUp	<ч71п..>,<t69p, t73p>                     
t73p:		DclUp	<ч73п..>,<t71p, t75p>                     
t75p:		DclUp	<ч75п..>,<t73p, t77p>                     
t77p:		DclUp	<ч77п..>,<t75p, t79p>                     
t79p:		DclUp	<ч79п..>,<t77p, t81p> 
t81p:		DclUp	<ч81п..>,<t79p, t83p>                        
t83p:		DclUp	<ч83п..>,<t81p, t85p>                     
t85p:		DclUp	<ч85п..>,<t83p, t87p>                     
t87p:		DclUp	<ч87п..>,<t85p, t89p>                     
t89p:		DclUp	<ч89п..>,<t87p, t91p>                     
t91p:		DclUp	<ч91п..>,<t89p, t93p>                     
t93p:		DclUp	<ч93п..>,<t91p, t95p>                     
t95p:		DclUp	<ч95п..>,<t93p, t97p>                     
t97p:		DclUp	<ч97п..>,<t95p, t99p>                     
t99p:		DclUp	<ч99п..>,<t97p, t101p> 
t101p:		DclUp	<ч101п.>,<t99p, t103p>                        
t103p:		DclUp	<ч103п.>,<t101p,t105p>                     
t105p:		DclUp	<ч105п.>,<t103p,t107p>                     
t107p:		DclUp	<ч107п.>,<t105p,t109p>                     
t109p:		DclUp	<ч109п.>,<t107p,t111p> 
t111p:		DclUp	<ч111п.>,<t109p,t113p>                        
t113p:		DclUp	<ч113п.>,<t111p,t115p>                     
t115p:		DclUp	<ч115п.>,<t113p,t117p>                     
t117p:		DclUp	<ч117п.>,<t115p,t119p>                     
t119p:		DclUp	<ч119п.>,<t117p,t121p> 
t121p:		DclUp	<ч121п.>,<t119p, t123p>                        
t123p:		DclUp	<ч123п.>,<t121p,t125p>                     
t125p:		DclUp	<ч125п.>,<t123p,t127p>                     
t127p:		DclUp	<ч127п.>,<t125p,t129p>                     
t129p:		DclUp	<ч129п.>,<t127p,t131p> 
t131p:		DclUp	<ч131п.>,<t129p,  ?>                        
;------------------------------------------------------------
t2p:		DclUp	<ч2п...>,<?,     t4p>                        
t4p:		DclUp	<ч4п...>,<t2p,   t6p>                     
t6p:		DclUp	<ч6п...>,<t4p,   t8p>                     
t8p:		DclUp	<ч8п...>,<t6p,   t10p>                     
t10p:		DclUp	<ч10п..>,<t8p,   t12p>                     
t12p:		DclUp	<ч12п..>,<t10p,  t14p>                     
t14p:		DclUp	<ч14п..>,<t12p,  t16p>                     
t16p:		DclUp	<ч16п..>,<t14p,  t18p>                     
t18p:		DclUp	<ч18п..>,<t16p,  t20p>                     
t20p:		DclUp	<ч20п..>,<t18p,  t22p> 
t22p:		DclUp	<ч22п..>,<t20p,  t24p>                        
t24p:		DclUp	<ч24п..>,<t22p,  t26p>                     
t26p:		DclUp	<ч26п..>,<t24p,  t28p>                     
t28p:		DclUp	<ч28п..>,<t26p,  t30p>                     
t30p:		DclUp	<ч30п..>,<t28p,  t32p>                     
t32p:		DclUp	<ч32п..>,<t30p,  t34p>                     
t34p:		DclUp	<ч34п..>,<t32p,  t36p>                     
t36p:		DclUp	<ч36п..>,<t34p,  t38p>                     
t38p:		DclUp	<ч38п..>,<t36p,  t40p>                     
t40p:		DclUp	<ч40п..>,<t38p,  t42p> 
t42p:		DclUp	<ч42п..>,<t40p,  t44p>                        
t44p:		DclUp	<ч44п..>,<t42p,  t46p>                     
t46p:		DclUp	<ч46п..>,<t44p,  t48p>                     
t48p:		DclUp	<ч48п..>,<t46p,  t50p>                     
t50p:		DclUp	<ч50п..>,<t48p,  t52p>                     
t52p:		DclUp	<ч52п..>,<t50p,  t54p>                     
t54p:		DclUp	<ч54п..>,<t52p,  t56p>                     
t56p:		DclUp	<ч56п..>,<t54p,  t58p>                     
t58p:		DclUp	<ч58п..>,<t56p,  t60p>                     
t60p:		DclUp	<ч60п..>,<t58p,  t62p> 
t62p:		DclUp	<ч62п..>,<t60p,  t64p>                        
t64p:		DclUp	<ч64п..>,<t62p,  t66p>                     
t66p:		DclUp	<ч66п..>,<t64p,  t68p>                     
t68p:		DclUp	<ч68п..>,<t66p,  t70p>                     
t70p:		DclUp	<ч70п..>,<t68p,  t72p>                     
t72p:		DclUp	<ч72п..>,<t70p,  t74p>                     
t74p:		DclUp	<ч74п..>,<t72p,  t76p>                     
t76p:		DclUp	<ч76п..>,<t74p,  t78p>                     
t78p:		DclUp	<ч78п..>,<t76p,  t80p>                     
t80p:		DclUp	<ч80п..>,<t78p,  t82p> 
t82p:		DclUp	<ч82п..>,<t80p,  t84p>                        
t84p:		DclUp	<ч84п..>,<t82p,  t86p>                     
t86p:		DclUp	<ч86п..>,<t84p,  t88p>                     
t88p:		DclUp	<ч88п..>,<t86p,  t90p>                     
t90p:		DclUp	<ч90п..>,<t88p,  t92p>                     
t92p:		DclUp	<ч92п..>,<t90p,  t94p>                     
t94p:		DclUp	<ч94п..>,<t92p,  t96p>                     
t96p:		DclUp	<ч96п..>,<t94p,  t98p>                     
t98p:		DclUp	<ч98п..>,<t96p, t100p>                     
t100p:		DclUp	<ч100п.>,<t98p, t102p> 
t102p:		DclUp	<ч102п.>,<t100p,t104p>                        
t104p:		DclUp	<ч104п.>,<t102p,t106p>                     
t106p:		DclUp	<ч106п.>,<t104p,t108p>                     
t108p:		DclUp	<ч108п.>,<t106p,t110p>                     
t110p:		DclUp	<ч110п.>,<t108p,t112p> 
t112p:		DclUp	<ч112п.>,<t110p,t114p>                        
t114p:		DclUp	<ч114п.>,<t112p,t116p>                     
t116p:		DclUp	<ч116п.>,<t114p,t118p>                     
t118p:		DclUp	<ч118п.>,<t116p,t120p>                     
t120p:		DclUp	<ч120п.>,<t118p,t122p> 
t122p:		DclUp	<ч122п.>,<t120p,t124p>                        
t124p:		DclUp	<ч124п.>,<t122p,t126p>                     
t126p:		DclUp	<ч126п.>,<t124p,t128p>                     
t128p:		DclUp	<ч128п.>,<t126p,t130p>                     
t130p:		DclUp	<ч130п.>,<t128p,t132p> 
t132p:		DclUp	<ч132п.>,<t130p,    ?>   
;------------------------------------------------------------
n1p:		DclUp	<н1п...>,<n3p,  ?>                        
n3p:		DclUp	<н3п...>,<n5p, n1p>                     
n5p:		DclUp	<н5п...>,<n7p, n3p>                     
n7p:		DclUp	<н7п...>,<n9p, n5p>                     
n9p:		DclUp	<н9п...>,<n11p,n7p>  
n11p:		DclUp	<н11п..>,<n13p,n9p>                        
n13p:		DclUp	<н13п..>,<n15p,n11p>                     
n15p:		DclUp	<н15п..>,<n17p,n13p>                     
n17p:		DclUp	<н17п..>,<n19p,n15p>                     
n19p:		DclUp	<н19п..>,<n21p,n17p> 
n21p:		DclUp	<н21п..>,<n23p,n19p>                        
n23p:		DclUp	<н23п..>,<n25p,n21p>                     
n25p:		DclUp	<н25п..>,<n27p,n23p>                     
n27p:		DclUp	<н27п..>,<?,   n25p>  
;------------------------------------------------------------
n2p:		DclUp	<н2п...>,<n4p,    ?> 
n4p:		DclUp	<н4п...>,<n6p,  n2p> 
n6p:		DclUp	<н6п...>,<n8p,  n4p> 
n8p:		DclUp	<н8п...>,<n10p, n6p> 
n10p:		DclUp	<н10п..>,<n12p, n8p> 
n12p:		DclUp	<н12п..>,<n14p, n10p> 
n14p:		DclUp	<н14п..>,<n16p, n12p> 
n16p:		DclUp	<н16п..>,<n18p, n14p> 
n18p:		DclUp	<н18п..>,<n20p, n16p> 
n20p:		DclUp	<н20п..>,<n22p, n18p> 
n22p:		DclUp	<н22п..>,<n24p, n20p> 
n24p:		DclUp	<н24п..>,<n26p, n22p> 
n26p:		DclUp	<н26п..>,<n28p, n24p> 
n28p:		DclUp	<н28п..>,<?,    n26p>                  
;=================================================
;        	класс: 2,       светофоры
;=================================================
			Public  KsKUZ
;-------------------------------------------------
KsKUZ:   	Cls     Ks
;-------------------------------------------------
Ks1t:     	DclKs   <1ч....>,Svt, <Sp1tp,uu1n>
Ks2t:     	DclKs   <2ч....>,Svt, <Sp2tp,up1t>
;-------------------------------------------------
Ks1n:     	DclKs   <1н....>,Svn, <up1n,Sp1np>
Ks2n:     	DclKs   <2н....>,Svn, <uu1t,Sp2np>
;-------------------------------------------------
Kstku:     	DclKs   <чкю...>,Svt, <Ksnku,spnku>
Ksnku:     	DclKs   <нкю...>,Svn, <?,Kstku>
;-------------------------------------------------
Kst1:     	DclKs   <ч1....>,Svt, <Sp1117,Kp1> 
Kst2:    	DclKs   <ч2....>,Svt, <Sp0913,Kp2>  
Kst3:    	DclKs   <ч3....>,Svt, <Sp1117,Kp3>
Kst4:    	DclKs   <ч4....>,Svt, <Sp1519,Kp4>
Kst6:    	DclKs   <ч6....>,Svt, <Sp1519,Kp6>
;-------------------------------------------------
Ksn1:     	DclKs   <н1....>,Svn, <Kp1,Sp1216>
Ksn2:       DclKs   <н2....>,Svn, <Kp2,Sp0610>
Ksn3:       DclKs   <н3....>,Svn, <Kp3,Sp1216>
Ksn4:       DclKs   <н4....>,Svn, <Kp4,Sp0814>
Ksn6:       DclKs   <н6....>,Svn, <Kp6,Sp0814>
;-------------------------------------------------
Ksm2:    	DclKs   <м2....>,Svtm,<Sp04,Sp2tp>   
Ksm4:    	DclKs   <м4....>,Svtm,<Sp02,Sp1tp> 
Ksm6:    	DclKs   <м6....>,Svtm,<Sp0610,Sp04>   
Ksm8:    	DclKs   <м8....>,Svtm,<Sp0814,Spm8tp>
Ksm10:    	DclKs   <м10...>,Svtm,<Sp1216,Sp02>         
;-------------------------------------------------
Ksm1:    	DclKs   <м1....>,Svnm,<Sp1np,Sp01>   
Ksm3:    	DclKs   <м3....>,Svnm,<Sp2np,Sp0307>  
Ksm5:    	DclKs   <м5....>,Svnm,<Spnku,Sp05>
Ksm7:    	DclKs   <м7....>,Svtm,<Sp0307,Sp0913>
Ksm9:    	DclKs   <м9....>,Svnm,<Sp05,Sp1519>
Ksm11:    	DclKs   <м11...>,Svnm,<Sp01,Sp1117>        
;=================================================
;        	Kласс: 3,       пути
;=================================================
			Public  KpKUZ
;-------------------------------------------------
KpKUZ:   	Cls     Kp
;-------------------------------------------------
Kp1:      	DclKp   <1.....>,<Kst1,Ksn1> 
Kp2:      	DclKp   <2.....>,<Kst2,Ksn2>  
Kp3:      	DclKp   <3.....>,<Kst3,Ksn3>  
Kp4:      	DclKp   <4.....>,<Kst4,Ksn4>
Kp6:      	DclKp   <6.....>,<Kst6,Ksn6> 
;=================================================
;        	Kласс: 4,       стрелки
;=================================================
			Public  StKUZ
;-------------------------------------------------
StKUZ:   	Cls     St
;-------------------------------------------------
St02:  		DclSt   <002...>,<Sp02>
St04:  	    DclSt   <004...>,<Sp04>
St06:  	    DclSt   <006...>,<Sp0610>
St08:    	DclSt   <008...>,<Sp0814>      
St10:    	DclSt   <010...>,<Sp0610>      
St12:    	DclSt   <012...>,<Sp1216> 
St14:    	DclSt   <014...>,<Sp0814>
St16:    	DclSt   <016...>,<Sp1216>  
;-------------------------------------------------
St01:    	DclSt   <001...>,<Sp01>
St03:    	DclSt   <003...>,<Sp0307>         
St05:    	DclSt   <005...>,<Sp05>   
St07:    	DclSt   <007...>,<Sp0307>
St09:    	DclSt   <009...>,<Sp0913>
St11:    	DclSt   <011...>,<Sp1117>
St13:    	DclSt   <013...>,<Sp0913>  
St15:      	DclSt   <015...>,<Sp1519>    
St17:      	DclSt   <017...>,<Sp1117>      
St19:    	DclSt   <019...>,<Sp1519>
;=================================================
;        	Kласс: 5,       стрелочные секции
;=================================================
			Public  SpKUZ
;-------------------------------------------------
SpKUZ:   	Cls     Sp
;-------------------------------------------------
Sp1tp: 		DclSp   <1чп...>
			OFF     <Ksm4>  
			OFF     <Ks1t>
Sp2tp: 		DclSp   <2чп...>
			OFF     <Ksm2>  
			OFF     <Ks2t>
;-------------------------------------------------
Sp1np: 		DclSp   <1нп...>
			OFF     <Ks1n>  
			OFF     <Ksm1>
Sp2np: 		DclSp   <2нп...>
			OFF     <Ks2n>  
			OFF     <Ksm3>
Spnku: 		DclSp   <нкюп..>
			OFF     <Kstku>  
			OFF     <ksm5>
;-------------------------------------------------
Spm8tp: 	DclSp   <м8п...>
			OFF     <Ksm8>  
			OFF     <?>		
;-------------------------------------------------
Sp02:    	DclSp   <002...>,<St02>
         	OFF     <ksm10,Sp04>
         	OFF     <Ksm4,Ksm4>
Sp04:  		DclSp   <004...>,<St04>
         	OFF     <ksm6,ksm6>
         	OFF     <ksm2,Sp02>
Sp0610:  	DclSp   <006010>,<St06,St10>
         	OFF     <Ksn2,Sp1216,Sp0814,Sp0814> 
         	OFF     <Ksm6,Ksm6,Ksm6,Ksm6>
Sp1216:    	DclSp   <012016>,<St12,St16>
         	OFF     <Ksn1,Ksn3,Ksn1,Ksn3>
         	OFF     <Ksm10,Ksm10,Sp0610,Sp0610>
Sp0814:    	DclSp   <008014>,<St14,St08>
         	OFF     <Ksn4,Ksn4,Ksn6,Ksn6>
         	OFF     <Ksm8,Sp0610,Ksm8,Sp0610>
;-------------------------------------------------
Sp01:    	DclSp   <001...>,<St01>
         	OFF     <Ksm1,Ksm1>
         	OFF     <Ksm11,Sp0307>                  
Sp0307:     DclSp   <003007>,<St07,St03>
         	OFF     <Ksm3,Sp01,Sp05,Sp05>
         	OFF     <Ksm7,Ksm7,Ksm7,Ksm7>
Sp05:    	DclSp   <005...>,<St05>
         	OFF     <Ksm5,Ksm5>
         	OFF     <Ksm9,Sp0307>
Sp0913:  	DclSp   <009013>,<St09,St13>
         	OFF     <Ksm7,Ksm7,Ksm7,Ksm7>
         	OFF     <Kst2,Sp1519,Sp1117,Sp1117>
Sp1117:  	DclSp   <011017>,<St11,St17>
         	OFF     <Ksm11,Ksm11,Sp0913,Sp0913>
         	OFF     <Kst1,Kst3,Kst1,Kst3>
Sp1519:     DclSp   <015019>,<St19,St15>     
         	OFF     <Ksm9,Sp0913,Ksm9,Sp0913>
         	OFF     <Kst4,Kst4,Kst6,Kst6>
;-------------------------------------------------
;			Перегоны
;-------------------------------------------------
PgKUZ:   	CLS     Pg
;-------------------------------------------------
k1tkp:     	DclPg  	<1чкп..>
k2tkp:      DclPg   <2чкп..> 
k1nkp:     	DclPg  	<1нкп..>
k2nkp:     	DclPg  	<2нкп..>
knkukp:    DclPg  	<нкюжкп>
;==================================================
;=================================================
;        	класс:  Двухпозиционные объекты
;=================================================
			Public  DpKUZ			
;-------------------------------------------------
DpKUZ:   	Cls     DP
;-------------------------------------------------
K1tkg:      DclDp   <1чкж..>  ;+
K2tkg:      DclDp   <2чкж..>  ;+
K1nkg:      DclDp   <1нкж..>  ;+
K2nkg:      DclDp   <2нкж..>  ;+
Kkugkg:     DclDp  	<кюжкж.>  ;+
;-------------------------------------------------
k1npb:      DclDp   <1нпб..>  ;+
k2npb:      DclDp   <2нпб..>  ;+
k1tpb:      DclDp   <1чпб..>  ;+
k2tpb:      DclDp   <2чпб..>  ;+
Knkupb:     DclDp   <нкюпб.>  ;+
;-------------------------------------------------
kro1t:       DclDp   <ро1ч..> ;+
kro1n:       DclDp   <ро1н..> ;+
kro2t:       DclDp   <ро2ч..> ;+
kro2n:       DclDp   <ро2н..> ;+
nkuRo:       DclDp   <нкюро.> ;+
;-------------------------------------------------
Kn1f:       DclDp   <н1ф...>,<84h,4Fh,"Нет 1 Фидера ">,<81h,2Bh,"Фидер 1 норма">  ;+
Kn2f:       DclDp   <н2ф...>,<84h,4Fh,"Нет 2 Фидера ">,<81h,2Bh,"Фидер 2 норма">  ;+
Kdgaz:		DclDp   <дгаз..> ;+
Krf1:       DclDp   <рф1...> ;+ 
Krf2:       DclDp   <рф2...> ;+ 
Kdga:		DclDp   <дга...> ;+
;-------------------------------------------------
Kpp:        DclDp   <кпп...>,<01h,2Bh,"КПП в норме  ">,<04h,4Fh,"КПП НеВНорме "> ;+
Kden:      	DclDp   <ден...> ;+
Kdsn:      	DclDp   <дсн...> ;+
Knpt:		DclDp   <нпт...> ;+
Kpt:		DclDp   <пт....> ;+
Kvsp:		DclDp   <всп...> ;+
Kawt:		DclDp   <авт...> ;+
Ktop:		DclDp   <топ...> ;+
;-------------------------------------------------
nku1dat:    DclDp   <кюдат1> ;+
nku2dat:    DclDp   <кюдат2> ;+
nku_kzk:    DclDp   <нкюкз.> ;+
;-------------------------------------------------
kfp:    	DclDp   <фп....> ;+
kpos:    	DclDp   <пос...> ;+
kps:    	DclDp   <пс....> ;+
kdso:    	DclDp   <дсо...> ;+
kesso:    	DclDp   <эссо..> ;+
;-------------------------------------------------
Kzdncsu:  	DclDp   <зднцсу> ;+ 
Kdnc:      	DclDp   <днц...> ;+ 
Kdsp: 	 	DclDp   <дсп...> ;+
Kkru: 	 	DclDp   <кру...> ;+
KzdncDu: 	DclDp   <днцду.> ;+
;-------------------------------------------------
Ksostu1: 	DclDp   <ту1...> ;+
Ksostu2: 	DclDp   <ту2...> ;+
Knezak: 	DclDp   <незак.> ;+
Kizkg: 		DclDp   <изкж..> ;+
Kmak:	 	DclDp   <мак...> ;+
Kizd: 		DclDp   <изд...> ;+
Kbld:	 	DclDp   <блд...> ;+
Kir:	 	DclDp   <ир....> ;+
Kobrdc:	 	DclDp   <обрдц.> ;+
;--------------------------------------------------
Kobsostl: 	DclDp   <обсл..> ;+
Kobsost:	DclDp   <обс...> ;+
Kp1ksu1:	DclDp   <кс1кп1> ;+
Kp2Ksu1:	DclDp   <кс1кп2> ;+
Kp1Ksu2:	DclDp   <кс2кп1> ;+
Kp2Ksu2: 	DclDp   <кс2кп2> ;+
K2rm3:	 	DclDp   <2рм3..> ;+
K2rm2:	 	DclDp   <2рм2..> ;+
K2rm1:	 	DclDp   <2рм1..> ;+
K1rm3:	 	DclDp   <1рм3..> ;+
K1rm2:	 	DclDp   <1рм2..> ;+
K1rm1:	 	DclDp   <1рм1..> ;+
K2ds:	 	DclDp   <2дс...> ;+
K1ds:	 	DclDp   <1дс...> ;+
KKgn:	 	DclDp   <кгн...> ;+
Kmont:	 	DclDp   <монт..> ;+
;------------------------------------------------
kog:        DclDp   <ог....> ;+
kad:        DclDp   <ад....> ;+
Kzam:       DclDp   <зам...> ;+ 
Km:         DclDp   <км....> ;+ 
Kmu:        DclDp   <кму...> ;+
Kuwo:       DclDp   <уво...> ;+ 
KuKsps:     DclDp   <укспс.> ;+
Kuvk:       DclDp   <увк...> ;+ 
Kruvk:      DclDp   <рувк..> ;+
kzp:        DclDp   <зпдсп.> ;+
;------------------------------------------------
ktsaut:		DclDp   <чсаут.> ;+
knsaut:		DclDp   <нсаут.> ;+
;----------------------------------------------
; Индикация электрообогрева шкафчиков и контроля изоляции шкафчиков
;----------------------------------------------
keo2:		DclDp	<эош2..>  ;+
keo4:		DclDp	<эош4..>  ;+
keo1:		DclDp	<эош1..>  ;+
keo3:		DclDp	<эош3..>  ;+
;----------------------------------------------
ki2:		DclDp	<ки2...>  ;+
ki4:		DclDp	<ки4...>  ;+
ki1:		DclDp	<ки1...>  ;+
ki3:		DclDp	<ки3...>  ;+
;------------------------------------------------
Kp1Og:		DclDp	<1ог...>  ;+
Kp2Og:		DclDp	<2ог...>  ;+
Kp3Og:		DclDp	<3ог...>  ;+
Kp4Og:		DclDp	<4ог...>  ;+
Kp6Og:		DclDp	<6ог...>  ;+
kiz:		DclDp	<из....>  ;+
;------------------------------------------------
tnl1nOG:		DclDp	<тн1ног>  ;+  ТОННЕЛЬ-1Н включено ограждение
tnl1nAV:		DclDp	<тн1нав>  ;+  ТОННЕЛЬ-1Н есть неисправность
Tnl1nMont:		DclDp	<тн1нм.>  ;+  ТОННЕЛЬ-1Н разрешен выход монтеров в тоннель или на мост
Tnl1nMontPred:	DclDp	<тн1нмр>  ;+  ТОННЕЛЬ-1Н идет процесс отмены разрешения на выход монтеров в тоннель или на мост
Tnl1nIzv:		DclDp	<тн1ни.>  ;+  ТОННЕЛЬ-1Н извещение на мост
;------------------------------------------------
tnl1npOG:		DclDp	<тн1пог>  ;+  ТНЭЦ-1НПП включено ограждение
tnl1npAV:		DclDp	<тн1пав>  ;+  ТНЭЦ-1НПП есть неисправность
Tnl1npMont:		DclDp	<тн1пм.>  ;+  ТНЭЦ-1НПП разрешен выход монтеров в тоннель или на мост
Tnl1npMontPred:	DclDp	<тн1пмр>  ;+  ТНЭЦ-1НПП идет процесс отмены разрешения на выход монтеров в тоннель или на мост
Tnl1npIzv:		DclDp	<тн1пи.>  ;+  ТНЭЦ-1НПП извещение на мост
;------------------------------------------------
tnl2nOG:		DclDp	<тн2ног>  ;+  ТОННЕЛЬ-2Н включено ограждение
tnl2nAV:		DclDp	<тн2нав>  ;+  ТОННЕЛЬ-2Н есть неисправность
Tnl2nMont:		DclDp	<тн2нм.>  ;+  ТОННЕЛЬ-2Н разрешен выход монтеров в тоннель или на мост
Tnl2nMontPred:	DclDp	<тн2нмр>  ;+  ТОННЕЛЬ-2Н идет процесс отмены разрешения на выход монтеров в тоннель или на мост
Tnl2nIzv:		DclDp	<тн2ни.>  ;+  ТОННЕЛЬ-2Н извещение на мост
;------------------------------------------------
tnl2npOG:		DclDp	<тн2пог>  ;+  ТНЭЦ-1НПП включено ограждение
tnl2npAV:		DclDp	<тн2пав>  ;+  ТНЭЦ-1НПП есть неисправность
Tnl2npMont:		DclDp	<тн2пм.>  ;+  ТНЭЦ-1НПП разрешен выход монтеров в тоннель или на мост
Tnl2npMontPred:	DclDp	<тн2пмр>  ;+  ТНЭЦ-1НПП идет процесс отмены разрешения на выход монтеров в тоннель или на мост
Tnl2npIzv:		DclDp	<тн2пи.>  ;+  ТНЭЦ-1НПП извещение на мост
;------------------------------------------------
t1kgu:			DclDp	<1чкгу.>  ;+  
t1kguKZ:		DclDp	<1чкз..>  ;+  
t2kgu:			DclDp	<2чкгу.>  ;+  
t2kguKZ:		DclDp	<2чкз..>  ;+  
n1kgu:			DclDp	<1нкгу.>  ;+  
n1kguKZ:		DclDp	<1нкз..>  ;+  
n2kgu:			DclDp	<2нкгу.>  ;+  
n2kguKZ:		DclDp	<2нкз..>  ;+ 
;------------------------------------------------
;   	Зоны Оповещения
;------------------------------------------------
Kizv2:		DclDp   <ом2...> 
Kzone2:		DclDp   <зона2.> 
Kizv4:		DclDp   <ом4...> 
Kzone4:		DclDp   <зона4.> 
Kizv6:		DclDp   <ом6...> 
Kzone6:		DclDp   <зона6.> 
Kizv1:		DclDp   <ом1...> 
Kzone1:		DclDp   <зона1.> 
Kizv3:		DclDp   <ом3...> 
Kzone3:		DclDp   <зона3.> 
Kizv5:		DclDp   <ом5...> 
Kzone5:		DclDp   <зона5.> 
Kizv7:		DclDp   <ом7...> 
Kzone7:		DclDp   <зона7.> 
;------------------------------------------------
uks1npp1:		DclDp  <1нп1..>,<81h,2Bh,"ОтмУКСП Ч 1  ">,<84h,4Fh,"  УКСП 1нп1  "> ;+ УКС-1НПП сработал датчик схода состава на ближнем участке приближения
uks1npp2:		DclDp  <1нп2..>,<81h,2Bh,"ОтмУКСП Ч 2  ">,<84h,4Fh,"  УКСП 1нп2  "> ;+ УКС-1НПП сработал датчик схода состава на дальнем участке приближения 
uks1nppKz:		DclDp  <1нпкз.> ;+ УКС-1НПП есть короткое замыкание жил кабеля в устройстве УКСПС
;
uks1tup1:		DclDp  <1чу1..>,<81h,2Bh,"ОтмУКСП Ч 1  ">,<84h,4Fh,"  УКСП Ч 1   "> ;+ УКС-1ЧУП сработал датчик схода состава на ближнем участке приближения
uks1tup2:		DclDp  <1чу2..>,<81h,2Bh,"ОтмУКСП Ч 2  ">,<84h,4Fh,"  УКСП Ч 2   "> ;+ УКС-1ЧУП сработал датчик схода состава на дальнем участке приближения
uks1tupKz:		DclDp  <1чукз.> ;+ УКС-1ЧУП есть короткое замыкание жил кабеля в устройстве УКСПС
;
uks2nup1:		DclDp  <2ну1..>,<81h,2Bh,"ОтмУКСП Ч 1  ">,<84h,4Fh,"  УКСП 1чу1  "> ;+ УКС-2НУП сработал датчик схода состава на ближнем участке приближения
uks2nup2:		DclDp  <2ну2..>,<81h,2Bh,"ОтмУКСП Ч 2  ">,<84h,4Fh,"  УКСП 1чу2  "> ;+ УКС-2НУП сработал датчик схода состава на дальнем участке приближения
uks2nupKz:		DclDp  <2нукз.> ;+ УКС-2НУП есть короткое замыкание жил кабеля в устройстве УКСПС
;
uks2tpp1:		DclDp  <2чп1..>,<81h,2Bh,"ОтмУКСП Ч 1  ">,<84h,4Fh,"  УКСП 2чп1  "> ;+ УКС-2ЧПП сработал датчик схода состава на ближнем участке приближения
uks2tpp2:		DclDp  <2чп2..>,<81h,2Bh,"ОтмУКСП Ч 2  ">,<84h,4Fh,"  УКСП 2чп2  "> ;+ УКС-2ЧПП сработал датчик схода состава на дальнем участке приближения 
uks2tppKz:		DclDp  <2чпкз.> ;+ УКС-2ЧПП есть короткое замыкание жил кабеля в устройстве УКСПС
;
uks1t1tup1:		DclDp  <11чу1.>,<81h,2Bh,"ОтмУКСП Ч 1  ">,<84h,4Fh,"  УКСП 11чу1 "> ;+ УКС1Ч-1ЧУП сработал датчик схода состава на ближнем участке приближения
uks1t1tup2:		DclDp  <11чу2.>,<81h,2Bh,"ОтмУКСП Ч 2  ">,<84h,4Fh,"  УКСП 11чу2 "> ;+ УКС1Ч-1ЧУП сработал датчик схода состава на дальнем участке приближения 
uks1t1tupKz:	DclDp  <11чукз> ;+ УКС1Ч-1ЧУП есть короткое замыкание жил кабеля в устройстве УКСПС
;
uks1t2tpp1:		DclDp  <12чп1.>,<81h,2Bh,"ОтмУКСП Ч 1  ">,<84h,4Fh,"  УКСП 12чп1 "> ;+ УКС1Ч-2ЧПП сработал датчик схода состава на ближнем участке приближения
uks1t2tpp2:		DclDp  <12чп2.>,<81h,2Bh,"ОтмУКСП Ч 2  ">,<84h,4Fh,"  УКСП 12чп2 "> ;+ УКС1Ч-2ЧПП сработал датчик схода состава на дальнем участке приближения 
uks1t2tppKz:	DclDp  <12чпкз> ;+ УКС1Ч-2ЧПП есть короткое замыкание жил кабеля в устройстве УКСПС
;
uks2t1tup1:		DclDp  <21чу1.>,<81h,2Bh,"ОтмУКСП Ч 1  ">,<84h,4Fh,"  УКСП 21чу1 "> ;+ УКС2Ч-1ЧУП сработал датчик схода состава на ближнем участке приближения
uks2t1tup2:		DclDp  <21чу2.>,<81h,2Bh,"ОтмУКСП Ч 2  ">,<84h,4Fh,"  УКСП 21чу2 "> ;+ УКС2Ч-1ЧУП сработал датчик схода состава на дальнем участке приближения 
uks2t1tupKz:	DclDp  <21чукз> ;+ УКС2Ч-1ЧУП есть короткое замыкание жил кабеля в устройстве УКСПС
;
uks2t2tpp1:		DclDp  <22чп1.>,<81h,2Bh,"ОтмУКСП Ч 1  ">,<84h,4Fh,"  УКСП 22чп1 "> ;+ УКС2Ч-2ЧПП сработал датчик схода состава на ближнем участке приближения
uks2t2tpp2:		DclDp  <22чп2.>,<81h,2Bh,"ОтмУКСП Ч 2  ">,<84h,4Fh,"  УКСП 22чп2 "> ;+ УКС2Ч-2ЧПП сработал датчик схода состава на дальнем участке приближения 
uks2t2tppKz:	DclDp  <22чпкз> ;+ УКС2Ч-2ЧПП есть короткое замыкание жил кабеля в устройстве УКСПС
;
uks1n1tup1:		DclDp  <1нчу1.>,<81h,2Bh,"ОтмУКСП Ч 1  ">,<84h,4Fh,"  УКСП 1нчу1 "> ;+ УКС1Н-1ЧУП сработал датчик схода состава на ближнем участке приближения
uks1n1tup2:		DclDp  <1нчу2.>,<81h,2Bh,"ОтмУКСП Ч 2  ">,<84h,4Fh,"  УКСП 1нчу2 "> ;+ УКС1Н-1ЧУП сработал датчик схода состава на дальнем участке приближения 
uks1n1tupKz:	DclDp  <1нчукз> ;+ УКС1Н-1ЧУП есть короткое замыкание жил кабеля в устройстве УКСПС
;
uks1n2tpp1:		DclDp  <2нчу1.>,<81h,2Bh,"ОтмУКСП Ч 1  ">,<84h,4Fh,"  УКСП 2нчу1 "> ;+ УКС1Н-2ЧУП сработал датчик схода состава на ближнем участке приближения
uks1n2tpp2:		DclDp  <2нчу2.>,<81h,2Bh,"ОтмУКСП Ч 2  ">,<84h,4Fh,"  УКСП 2нчу2 "> ;+ УКС1Н-2ЧУП сработал датчик схода состава на дальнем участке приближения 
uks1n2tppKz:	DclDp  <2нчукз> ;+ УКС1Н-2ЧУП есть короткое замыкание жил кабеля в устройстве УКСПС
;
;------------------------------------------------
;		Мостовая сигнализация
;------------------------------------------------
most1_Zg:		DclDp  <мст1зг> ;+
most1_PrAv:		DclDp  <мст1ав> ;+
most1_RRmont:	DclDp  <мст1рр> ;+
most1_Mont:		DclDp  <мст1мт> ;+
most2_Zg:		DclDp  <мст2зг> ;+
most2_PrAv:		DclDp  <мст2ав> ;+
most2_RRmont:	DclDp  <мст2рр> ;+ 
most2_Mont:		DclDp  <мст2мт> ;+
most_Zg:		DclDp  <мстзг.> ;+ 
most_PrAv:		DclDp  <мстав.> ;+ 
most_RRmont:	DclDp  <мстрр.> ;+ 
most_Mont:		DclDp  <мстмт.> ;+ 
;=================================================
;       	Kласс:  Сложные объекты
;=================================================
SoKUZ:      Cls SO 
;-------------------------------------------------
;    Зоны оповещения и разрешения монтерам пути 
;------------------------------------------------------------------
Fz01om:		So_Fun  <01ом..>,<Fizv1>
Fz11om:		So_Fun  <11ом..>,<Fizv1>
Fz17om:		So_Fun  <17ом..>,<Fizv1>
;-----------
Fz01:		So_Fun  <01зона>,<Fzone1>
Fz11:		So_Fun  <11зона>,<Fzone1>
Fz17:		So_Fun  <17зона>,<Fzone1>
;-----------
Fizv1:		So_And  <изв1..>,<Fizv1a,Fzone1>,<Kizv1>
Fizv1a:		So_Or   <изв1..>,<Fz01om+Tps,Fz11om+Tps,Fz17om+Tps>

Fzone1:		So_Or   <1зона.>,<Fz01+Tak,Fz11+Tak,Fz17+Tak>,<Kzone1>
;------------------------------------------------------------------
;------------------------------------------------------------------
Fz03om:		So_Fun  <03ом..>,<Fizv3>
Fz07om:		So_Fun  <07ом..>,<Fizv3>
Fz09om:		So_Fun  <09ом..>,<Fizv3>
Fz13om:		So_Fun  <13ом..>,<Fizv3>
;-----------
Fz03:		So_Fun  <03зона>,<Fzone3>
Fz07:		So_Fun  <07зона>,<Fzone3>
Fz09:		So_Fun  <09зона>,<Fzone3>
Fz13:		So_Fun  <13зона>,<Fzone3>
;-----------
Fizv3:		So_And  <изв3..>,<Fizv3a,Fzone3>,<Kizv3>
Fizv3a:		So_Or   <изв3..>,<Fz03om+Tps,Fz07om+Tps,Fz09om+Tps,Fz13om+Tps>

Fzone3:		So_Or   <3зона.>,<Fz03+Tak,Fz07+Tak,Fz09+Tak,Fz13+Tak>,<Kzone3>
;------------------------------------------------------------------
;------------------------------------------------------------------
Fz05om:		So_Fun  <05ом..>,<Fizv5>
;-----------
Fz05:		So_Fun  <05зона>,<Fzone5>
;-----------
Fizv5:		So_And  <изв5..>,<Fizv5a,Fzone5>,<Kizv5>
Fizv5a:		So_Or   <изв5..>,<Fz05om+Tps>

Fzone5:		So_Or   <5зона.>,<Fz05+Tak>,<Kzone5>
;------------------------------------------------------------------
;------------------------------------------------------------------
Fz15om:		So_Fun  <15ом..>,<Fizv7>
Fz19om:		So_Fun  <19ом..>,<Fizv7>
;-----------
Fz15:		So_Fun  <15зона>,<Fzone7>
Fz19:		So_Fun  <19зона>,<Fzone7>
;-----------
Fizv7:		So_And  <изв7..>,<Fizv7a,Fzone7>,<Kizv7>
Fizv7a:		So_Or   <изв7..>,<Fz15om+Tps,Fz19om+Tps>

Fzone7:		So_Or   <7зона.>,<Fz15+Tak,Fz19+Tak>,<Kzone7>
;------------------------------------------------------------------
;------------------------------------------------------------------
Fz02om:		So_Fun  <02ом..>,<Fizv2>
Fz12om:		So_Fun  <12ом..>,<Fizv2>
Fz16om:		So_Fun  <16ом..>,<Fizv2>
;-----------
Fz02:		So_Fun  <02зона>,<Fzone2>
Fz12:		So_Fun  <12зона>,<Fzone2>
Fz16:		So_Fun  <16зона>,<Fzone2>
;-----------
Fizv2:		So_And  <изв2..>,<Fizv2a,Fzone2>,<Kizv2>
Fizv2a:		So_Or   <изв2..>,<Fz02om+Tps,Fz12om+Tps,Fz16om+Tps>

Fzone2:		So_Or   <2зона.>,<Fz02+Tak,Fz12+Tak,Fz16+Tak>,<Kzone2>
;------------------------------------------------------------------
;------------------------------------------------------------------
Fz04om:		So_Fun  <04ом..>,<Fizv4>
Fz06om:		So_Fun  <06ом..>,<Fizv4>
Fz10om:		So_Fun  <10ом..>,<Fizv4>
;-----------
Fz04:		So_Fun  <04зона>,<Fzone4>
Fz06:		So_Fun  <06зона>,<Fzone4>
Fz10:		So_Fun  <10зона>,<Fzone4>
;-----------
Fizv4:		So_And  <изв4..>,<Fizv4a,Fzone4>,<Kizv4>
Fizv4a:		So_Or   <изв4..>,<Fz04om+Tps,Fz06om+Tps,Fz10om+Tps>

Fzone4:		So_Or   <4зона.>,<Fz04+Tak,Fz06+Tak,Fz10+Tak>,<Kzone4>
;------------------------------------------------------------------
;------------------------------------------------------------------
Fz08om:		So_Fun  <08ом..>,<Fizv6>
Fz14om:		So_Fun  <14ом..>,<Fizv6>
;-----------
Fz08:		So_Fun  <08зона>,<Fzone6>
Fz14:		So_Fun  <14зона>,<Fzone6>
;-----------
Fizv6:		So_And  <изв4..>,<Fizv6a,Fzone6>,<Kizv6>
Fizv6a:		So_Or   <изв4..>,<Fz08om+Tps,Fz14om+Tps>

Fzone6:		So_Or   <4зона.>,<Fz08+Tak,Fz14+Tak>,<Kzone6>
;------------------------------------------------------------------
;------------------------------------------------------------------
; Мостовое извещение
;------------------
Ftnl1nIzvt:		So_Fun   <тн1нчи>,<Ftnl1Izv>	;извещение четное
Ftnl1nIzvn:		So_Fun	 <тн1нни>,<Ftnl1Izv> 	;извещение нечетное
Ftnl1Izv:		So_Or	 <......>,<Ftnl1nIzvn+Tak,Ftnl1nIzvt+Tak>,<Tnl1nIzv>
;------------------
Ftnl1npIzvt:	So_Fun   <тл1пчи>,<Ftnl1npIzv>	;извещение четное
Ftnl1npIzvn:	So_Fun	 <тл1пни>,<Ftnl1npIzv> 	;извещение нечетное
Ftnl1npIzv:		So_Or	 <......>,<Ftnl1npIzvt+Tak,Ftnl1npIzvn+Tak>,<Tnl1npIzv>
;------------------
Ftnl2nIzvt:		So_Fun   <тн2нчи>,<Ftnl2Izv>	;извещение четное
Ftnl2nIzvn:		So_Fun	 <тн2нни>,<Ftnl2Izv> 	;извещение нечетное
Ftnl2Izv:		So_Or	 <......>,<Ftnl2nIzvt+Tak,Ftnl2nIzvn+Tak>,<Tnl2nIzv>
;------------------
Ftnl2npIzvt:	So_Fun   <тл2пчи>,<Ftnl2npIzv>	;извещение четное
Ftnl2npIzvn:	So_Fun	 <тл2пни>,<Ftnl2npIzv> 	;извещение нечетное
Ftnl2npIzv:		So_Or	 <......>,<Ftnl2npIzvt+Tak,Ftnl2npIzvn+Tak>,<Tnl2npIzv>
;------------------
; Логическая занятость
;------------------
Fsp01Loga:	So_Fun   <01лг..>,<Fs01Log>	;логическая занятость
Fsp01Logb:	So_Fun	 <01ост.>,<Fs01Log> ;остаточная занятость
Fs01Log:	So_Or	 <......>,<Fsp01Loga+Tak,Fsp01Logb+Tak>,<Sp01+Log>
;------------------
Fsp02Loga:	So_Fun   <02лг..>,<Fs02Log>
Fsp02Logb:	So_Fun	 <02ост.>,<Fs02Log>
Fs02Log:	So_Or	 <......>,<Fsp02Loga+Tak,Fsp02Logb+Tak>,<Sp02+Log>
;------------------
Fsp0307Loga:So_Fun   <0307лг>,<Fs0307Log>
Fsp0307Logb:So_Fun	 <0307ос>,<Fs0307Log>;остаточная занятость
Fs0307Log:	So_Or	 <......>,<Fsp0307Loga+Tak,Fsp0307Logb+Tak>,<Sp0307+Log>
;------------------
Fsp04Loga:So_Fun   	 <04лг..>,<Fs04Log>
Fsp04Logb:So_Fun	 <04ос..>,<Fs04Log>;остаточная занятость
Fs04Log:  So_Or	 	 <......>,<Fsp04Loga+Tak,Fsp04Logb+Tak>,<Sp04+Log>
;------------------
Fsp05Loga:So_Fun   	 <05лг..>,<Fs05Log>
Fsp05Logb:So_Fun	 <05ос..>,<Fs05Log>;остаточная занятость
Fs05Log:  So_Or	 	 <......>,<Fsp05Loga+Tak,Fsp05Logb+Tak>,<Sp05+Log>
;------------------
Fsp0913Loga:So_Fun   <0913лг>,<Fs0913Log>
Fsp0913Logb:So_Fun	 <0913ос>,<Fs0913Log>;остаточная занятость
Fs0913Log:	So_Or	 <......>,<Fsp0913Loga+Tak,Fsp0913Logb+Tak>,<Sp0913+Log>
;------------------
Fsp0610Loga:So_Fun   <0610лг>,<Fs0610Log>
Fsp0610Logb:So_Fun	 <0610ос>,<Fs0610Log>;остаточная занятость
Fs0610Log:	So_Or	 <......>,<Fsp0610Loga+Tak,Fsp0610Logb+Tak>,<Sp0610+Log>
;------------------
Fsp1117Loga:So_Fun   <1117лг>,<Fs1117Log>
Fsp1117Logb:So_Fun	 <1117ос>,<Fs1117Log>;остаточная занятость
Fs1117Log:	So_Or	 <......>,<Fsp1117Loga+Tak,Fsp1117Logb+Tak>,<Sp1117+Log>
;------------------
Fsp1519Loga:So_Fun   <1519лг>,<Fs1519Log>
Fsp1519Logb:So_Fun	 <1519ос>,<Fs1519Log>;остаточная занятость
Fs1519Log:	So_Or	 <......>,<Fsp1519Loga+Tak,Fsp1519Logb+Tak>,<Sp1519+Log>
;------------------
Fsp1216Loga:So_Fun   <1216лг>,<Fs1216Log>
Fsp1216Logb:So_Fun	 <1216ос>,<Fs1216Log>;остаточная занятость
Fs1216Log:	So_Or	 <......>,<Fsp1216Loga+Tak,Fsp1216Logb+Tak>,<Sp1216+Log>
;------------------
Fsp0814Loga:So_Fun   <0814лг>,<Fs0814Log>
Fsp0814Logb:So_Fun	 <0814ос>,<Fs0814Log>;остаточная занятость
Fs0814Log:	So_Or	 <......>,<Fsp0814Loga+Tak,Fsp0814Logb+Tak>,<Sp0814+Log>
;------------------
Fsp1npLoga:	So_Fun   <1нплг.>,<Fs1npLog>
Fsp1npLogb:	So_Fun	 <1нпос.>,<Fs1npLog>;остаточная занятость
Fs1npLog:	So_Or	 <......>,<Fsp1npLoga+Tak,Fsp1npLogb+Tak>,<Sp1np+Log>
;------------------
Fsp2npLoga:	So_Fun   <2нплг.>,<Fs2npLog>
Fsp2npLogb:	So_Fun	 <2нпос.>,<Fs2npLog>;остаточная занятость
Fs2npLog:	So_Or	 <......>,<Fsp2npLoga+Tak,Fsp2npLogb+Tak>,<Sp2np+Log>
;------------------
FspnkuLoga:	So_Fun   <2нплг.>,<FsnkuLog>
FspnkuLogb:	So_Fun	 <2нпос.>,<FsnkuLog>;остаточная занятость
FsnkuLog:	So_Or	 <......>,<FspnkuLoga+Tak,FspnkuLogb+Tak>,<Spnku+Log>
;------------------
Fsp1tpLoga:	So_Fun   <1нплг.>,<Fs1tpLog>
Fsp1tpLogb:	So_Fun	 <1нпос.>,<Fs1tpLog>;остаточная занятость
Fs1tpLog:	So_Or	 <......>,<Fsp1tpLoga+Tak,Fsp1tpLogb+Tak>,<Sp1tp+Log>
;------------------
Fsp2tpLoga:	So_Fun   <2нплг.>,<Fs2tpLog>
Fsp2tpLogb:	So_Fun	 <2нпос.>,<Fs2tpLog>;остаточная занятость
Fs2tpLog:	So_Or	 <......>,<Fsp2tpLoga+Tak,Fsp2tpLogb+Tak>,<Sp2tp+Log>
;------------------
Fkp1Loga:	So_Fun   <1плг..>,<Fk1Log>
Fkp1Logb:	So_Fun	 <1пос..>,<Fk1Log>;остаточная занятость
Fk1Log:		So_Or	 <......>,<Fkp1Loga+Tak,Fkp1Logb+Tak>,<Kp1+Log>
;------------------
Fkp2Loga:	So_Fun   <2плг..>,<Fk2Log>
Fkp2Logb:	So_Fun	 <2пос..>,<Fk2Log>;остаточная занятость
Fk2Log:		So_Or	 <......>,<Fkp2Loga+Tak,Fkp2Logb+Tak>,<Kp2+Log>
;------------------
Fkp3Loga:	So_Fun   <3плг..>,<Fk3Log>
Fkp3Logb:	So_Fun	 <3пос..>,<Fk3Log>;остаточная занятость
Fk3Log:		So_Or	 <......>,<Fkp3Loga+Tak,Fkp3Logb+Tak>,<Kp3+Log>
;------------------
Fkp4Loga:	So_Fun   <4плг..>,<Fk4Log>
Fkp4Logb:	So_Fun	 <4пос..>,<Fk4Log>;остаточная занятость
Fk4Log:		So_Or	 <......>,<Fkp4Loga+Tak,Fkp4Logb+Tak>,<Kp4+Log>
;------------------
Fkp6Loga:	So_Fun   <6плг..>,<Fk6Log>
Fkp6Logb:	So_Fun	 <6пос..>,<Fk6Log>;остаточная занятость
Fk6Log:		So_Or	 <......>,<Fkp6Loga+Tak,Fkp6Logb+Tak>,<Kp6+Log>
;=================================================
;       	Список групп сигналов тс
;-------------------------------------------------
        	BegGr   KU1
;-------------------------------------------------
	    	Stb		1
Gr03_1:       Gr  	<ks1n+Av,ks1n+SvBlk,ks1n,ks1n+Ps,-ks1n+Ro,ks1n+Ad,ks1n+Fd,ks1t+Av>
Gr04_1:       Gr  	<ks1t+SvBlk,ks1t,ks1t+Ps,-ks1t+Ro,ks1t+Ad,ks1t+Fd,ks2n+Av,ks2n+SvBlk>  
Gr05_1:       Gr  	<ks2n,ks2n+Ps,-ks2n+Ro,ks2n+Ad,?,?,?,?>
;
	    	Stb		2
Gr06_1:		Gr		<ks2n+Fd,ks2t+Av,ks2t+SvBlk,ks2t,ks2t+Ps,-ks2t+Ro,ks2t+Ad,ks2t+Fd>
Gr07_1:		Gr		<ksm1,-ksm1+Ro,Ksm1+SvBlk,?,ksm2,-ksm2+Ro,ksm2+SvBlk,?>
Gr08_1:   	Gr  	<ksm3,-ksm3+Ro,ksm3+SvBlk,?,?,?,?,?>
;
	    	Stb		3
Gr09_1:		Gr		<ksm4,-ksm4+Ro,ksm4+SvBlk,?,ksm5,-ksm5+Ro,ksm5+SvBlk,?>
Gr0A_1:		Gr		<ksm6,-ksm6+Ro,ksm6+SvBlk,?,ksm7,-ksm7+Ro,ksm7+SvBlk,?>
Gr0B_1:   	Gr  	<ksm8,-ksm8+Ro,ksm8+SvBlk,?,?,?,?,?>
;
	    	Stb		4
Gr0C_1:		Gr		<ksm9,-ksm9+Ro,ksm9+SvBlk,?,ksm10,-ksm10+Ro,ksm10+SvBlk,?>
Gr0D_1:		Gr		<ksm11,-ksm11+Ro,ksm11+SvBlk,?,ksn1+Ms,-Ksn1+Ro,Ksn1+SvBlk,Ksn1>
Gr0E_1:		Gr		<ksn1+Ps,ksn1+Ad,?,ksn2+Ms,?,?,?,?>
;
	    	Stb		5
Gr0F_1:		Gr		<-Ksn2+Ro,Ksn2+SvBlk,Ksn2,ksn2+Ps,ksn2+Ad,?,ksn3+Ms,-Ksn3+Ro>
Gr10_1:		Gr		<Ksn3+SvBlk,Ksn3,ksn3+Ps,ksn3+Ad,?,ksn4+Ms,-Ksn4+Ro,Ksn4+SvBlk>
Gr11_1:		Gr		<Ksn4,ksn4+Ps,ksn4+Ad,?,?,?,?,?>
;
	    	Stb		6
Gr12_1:		Gr		<ksn6+Ms,-Ksn6+Ro,Ksn6+SvBlk,Ksn6,ksn6+Ps,ksn6+Ad,?,-ksnku+Ro>
Gr13_1:		Gr		<ksnku+SvBlk,ksnku,ksnku+Ps,ksnku+Ad,ksnku+Fd,kst1+Ms,?,-Kst1+Ro>
Gr14_1:		Gr		<Kst1+SvBlk,Kst1,Kst1+Ps,Kst1+Ad,?,?,?,?>
;
	    	Stb		7
Gr15_1:		Gr		<?,kst2+Ms,-Kst2+Ro,Kst2+SvBlk,Kst2,Kst2+Ps,Kst2+Ad,?>
Gr16_1:     Gr      <kst3+Ms,-Kst3+Ro,Kst3+SvBlk,Kst3,Kst3+Ps,Kst3+Ad,?,kst4+Ms>
Gr17_1:		Gr		<-Kst4+Ro,Kst4+SvBlk,Kst4,Kst4+Ps,?,?,?,?>
;
	    	Stb		8
Gr18_1:		Gr		<Kst4+Ad,?,kst6+Ms,-Kst6+Ro,Kst6+SvBlk,Kst6,Kst6+Ps,Kst6+Ad>
Gr19_1:   	Gr		<?,Kstku+Av,Kstku+SvBlk,Kstku,Kstku+Ps,-Kstku+Ro,Kstku+Ad,Kstku+Fd>
Gr1A_1:		Gr		<St01+Pk,St01+Mk,St01+Avk,Fz01,?,?,?,?>
;	        
	    	Stb		9
Gr1B_1:		Gr		<Fz01om,St01+Os,?,?,St02+Pk,St02+Mk,St02+Avk,Fz02>
Gr1C_1:   	Gr		<Fz02om,St02+Os,?,?,St03+Pk,St03+Mk,St03+Avk,Fz03>
Gr1D_1:		Gr		<Fz03om,St03+Os,?,?,?,?,?,?>
;	        
	    	Stb		10
Gr1E_1:   	Gr		<St04+Pk,St04+Mk,St04+Avk,Fz04,Fz04om,St04+Os,?,?>
Gr1F_1:		Gr		<St05+Pk,St05+Mk,St05+Avk,Fz05,Fz05om,St05+Os,?,?>
Gr20_1:   	Gr		<St06+Pk,St06+Mk,St06+Avk,Fz06,?,?,?,?>
;
	    	Stb		11
Gr21_1:   	Gr		<Fz06om,St06+Os,?,?,St07+Pk,St07+Mk,St07+Avk,Fz07>
Gr22_1:		Gr		<Fz07om,St07+Os,?,?,St08+Pk,St08+Mk,St08+Avk,Fz08>
Gr23_1:   	Gr		<Fz08om,St08+Os,?,?,?,?,?,?>
;	        
	    	Stb		12
Gr24_1:   	Gr		<St09+Pk,St09+Mk,St09+Avk,Fz09,Fz09om,St09+Os,?,?>
Gr25_1:		Gr		<St10+Pk,St10+Mk,St10+Avk,Fz10,Fz10om,St10+Os,?,?>
Gr26_1:   	Gr		<St11+Pk,St11+Mk,St11+Avk,Fz11,?,?,?,?>
;
	    	Stb		13
Gr27_1:   	Gr		<Fz11om,St11+Os,?,?,St12+Pk,St12+Mk,St12+Avk,Fz12>
Gr28_1:		Gr		<Fz12om,St12+Os,?,?,St13+Pk,St13+Mk,St13+Avk,Fz13>
Gr29_1:		Gr      <Fz13om,St13+Os,?,?,?,?,?,?>
;
	    	Stb		14
Gr2A_1:		Gr      <St14+Pk,St14+Mk,St14+Avk,Fz14,Fz14om,St14+Os,?,?>
Gr2B_1:   	Gr		<St15+Pk,St15+Mk,St15+Avk,Fz15,Fz15om,St15+Os,?,?>
Gr2C_1:		Gr		<St16+Pk,St16+Mk,St16+Avk,Fz16,?,?,?,?>
;
   			Stb		15
Gr2D_1:		Gr		<Fz16om,St16+Os,?,?,St17+Pk,St17+Mk,St17+Avk,Fz17>
Gr2E_1:   	Gr		<Fz17om,St17+Os,?,?,St19+Pk,St19+Mk,St19+Avk,Fz19>
Gr2F_1:		Gr		<Fz19om,St19+Os,?,?,?,?,?,?>
;
   			Stb		16
Gr30_1:		Gr		<Sp01+Zs,Sp01+Ir,-Sp01,FSp01Loga,?,?,?,FSp01Logb>
Gr31_1:   	Gr		<?,?,?,?,Sp02+Zs,Sp02+Ir,-Sp02,FSp02Loga>
Gr32_1:		Gr		<?,?,?,FSp02Logb,?,?,?,?>
;
   			Stb		17
Gr33_1:		Gr		<?,?,?,?,Sp0307+Zs,Sp0307+Ir,-Sp0307,FSp0307Loga>
Gr34_1:   	Gr		<?,?,?,FSp0307Logb,?,?,?,?>
Gr35_1:		Gr		<Sp04+Zs,Sp04+Ir,-Sp04,FSp04Loga,?,?,?,?>
;	
	    	Stb		18
Gr36_1:		Gr		<?,?,?,FSp04Logb,?,?,?,?>
Gr37_1:   	Gr		<Sp05+Zs,Sp05+Ir,-Sp05,FSp05Loga,?,?,?,FSp05Logb>
Gr38_1:		Gr		<?,?,?,?,?,?,?,?>
;	
	    	Stb		19
Gr39_1:		Gr		<Sp0610+Zs,Sp0610+Ir,-Sp0610,FSp0610Loga,?,?,?,FSp0610Logb>
Gr3A_1:   	Gr		<?,?,?,?,Sp0814+Zs,Sp0814+Ir,-Sp0814,FSp0814Loga>
Gr3B_1:		Gr		<?,?,?,FSp0814Logb,?,?,?,?>
;
	    	Stb		20
Gr3C_1:		Gr		<?,?,?,?,Sp0913+Zs,Sp0913+Ir,-Sp0913,FSp0913Loga>
Gr3D_1:		Gr      <?,?,?,FSp0913Logb,?,?,?,?>
Gr3E_1:		Gr		<Sp1117+Zs,Sp1117+Ir,-Sp1117,FSp1117Loga,?,?,?,?>
;
	       	Stb     21
Gr3F_1:   	Gr      <?,?,?,FSp1117Logb,?,?,?,?>
Gr40_1:   	Gr      <Sp1216+Zs,Sp1216+Ir,-Sp1216,FSp1216Loga,?,?,?,FSp1216Logb>
Gr41_1:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     22                                                               
Gr42_1:   	Gr      <Sp1519+Zs,Sp1519+Ir,-Sp1519,FSp1519Loga,?,?,?,FSp1519Logb>
Gr43_1:   	Gr      <?,?,?,?,Sp1np+Zs,Sp1np+Ir,-Sp1np,FSp1npLoga>
Gr44_1:     Gr      <?,?,FSp1npLogb,?,?,?,?,?>
;
			Stb     23
Gr45_1:   	Gr      <?,?,?,Sp1tp+Zs,Sp1tp+Ir,-Sp1tp,FSp1tpLoga,?>
Gr46_1:   	Gr      <?,FSp1tpLogb,?,?,?,?,Sp2np+Zs,Sp2np+Ir>
Gr47_1:     Gr      <-Sp2np,FSp2npLoga,?,?,?,?,?,?>
;
			Stb     24
Gr48_1:   	Gr      <FSp2npLogb,?,?,?,?,Sp2tp+Zs,Sp2tp+Ir,-Sp2tp>
Gr49_1:   	Gr      <FSp2tpLoga,?,?,FSp2tpLogb,?,?,?,?>
Gr4A_1:     Gr      <Spnku+Zs,Spnku+Ir,-Spnku,FSpnkuLoga,?,?,?,?>
;
			Stb     25										;			Stb     25													
Gr4B_1:   	Gr      <?,?,FSpnkuLogb,?,?,?,?,?>              ;Gr4B_1:   	Gr      <?,?,FSpnkuLogb,?,?,?,?,t1p>                      
Gr4C_1:   	Gr      <?,?,?,?,?,?,?,?>       				;Gr4C_1:   	Gr      <t1p+Log,t3p,t3p+Log,t5p,t5p+Log,t7p,t7p+Log,t9p> 
Gr4D_1:     Gr      <?,?,?,?,?,?,?,?>                		;Gr4D_1:    Gr      <t9p+Log,t11p,t11p+Log,t13p,?,?,?,?>              
;
			Stb     26										;			Stb     26
Gr4E_1:   	Gr      <?,?,?,?,?,?,?,?> 						;Gr4E_1:   	Gr      <t13p+Log,t15p,t15p+Log,t17p,t17p+Log,t19p,t19p+Log,t2p>
Gr4F_1:   	Gr      <?,?,?,?,?,?,?,?>          				;Gr4F_1:   	Gr      <t2p+Log,t4p,t4p+Log,t6p,t6p+Log,t8p,t8p+Log,t10p>
Gr50_1:     Gr      <?,?,?,?,?,?,?,?>                       ;Gr50_1:    Gr      <t10p+Log,t12p,t12p+Log,t14p,?,?,?,?>
;
			Stb     27										;			Stb     27
Gr51_1:   	Gr      <?,?,?,?,?,?,?,?>            			;Gr51_1:   	Gr      <t14p+Log,t16p,t16p+Log,t18p,t18p+Log,t20p,t20p+Log,n1p>
Gr52_1:   	Gr      <?,?,?,?,?,?,?,?>                   	;Gr52_1:   	Gr      <n1p+Log,n3p,n3p+Log,n5p,n5p+Log,n7p,n7p+Log,n9p>
Gr53_1:     Gr      <?,?,?,?,?,?,?,?>                       ;Gr53_1:    Gr     	<n9p+Log,n2p,n2p+Log,n4p,?,?,?,?>
;
			Stb     28															;			Stb     28
Gr54_1:   	Gr      <?,?,?,?,?,?,?,Kp1+Zs>      								;Gr54_1:   	Gr      <n4p+Log,n6p,n6p+Log,n8p,n8p+Log,n10p,n10p+Log,Kp1+Zs>
Gr55_1:   	Gr      <Kp1Og,-Kp1,Fkp1loga,?,?,Fkp1logb,?,?>                      ;Gr55_1:   	Gr      <Kp1Og,-Kp1,Fkp1loga,?,?,Fkp1logb,?,?>
Gr56_1:     Gr      <?,?,Kp2+Zs,Kp2Og,?,?,?,?>                                  ;Gr56_1:     Gr      <?,?,Kp2+Zs,Kp2Og,?,?,?,?>
;
			Stb     29
Gr57_1:   	Gr      <-Kp2,Fkp2loga,?,?,Fkp2logb,?,?,?>
Gr58_1:   	Gr      <?,Kp3+Zs,Kp3Og,-Kp3,Fkp3loga,?,?,Fkp3logb>
Gr59_1:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     30
Gr5A_1:   	Gr      <Kp4+Zs,Kp4Og,-Kp4,Fkp4loga,?,?,Fkp4logb,?>
Gr5B_1:   	Gr      <?,?,?,Kp6+Zs,Kp6Og,-Kp6,Fkp6loga,?>
Gr5C_1:     Gr      <?,Fkp6logb,?,?,?,?,?,?>
;
			Stb     31
Gr5D_1:   	Gr      <?,?,k1nkp+Rvr,-up1n,-up2n,?,-k1nkp,-k1nkg>
Gr5E_1:   	Gr      <kro1n,k1npb,?,?,?,?,k1tkp+Rvr,-uu1t>
Gr5F_1:     Gr      <-uu2t,?,-k1tkp,-k1tkg,?,?,?,?>
;
			Stb     32
Gr60_1:   	Gr      <kro1t,k1tpb,?,?,?,?,k2nkp+Rvr,-up1t>
Gr61_1:   	Gr      <-up2t,?,-k2nkp,-K2nkg,kro2n,k2npb,?,?>
Gr62_1:     Gr      <?,?,k2tkp+Rvr,-uu1n,?,?,?,?>
;
			Stb     33
Gr63_1:   	Gr      <-uu2n,?,-k2tkp,-K2tkg,kro2t,k2tpb,?,?>
Gr64_1:   	Gr      <?,?,?,?,?,?,?,?>  ;определить откуда снимать сигналы с перегона ЧКЮ.
Gr65_1:     Gr      <nkuRo,Knkupb,?,?,?,?,?,?>           ;
;
			Stb     34
Gr66_1:   	Gr     <?,?,knkukp+Rvr,-up1kug,-knkukp,nku1dat,nku2dat,nku_kzk>
Gr67_1:   	Gr     <-Kkugkg,kfp,kpos,kps,kdso,kesso,tnl1nOG,tnl1nAV>
Gr68_1:     Gr     <Ftnl1nIzvt,Ftnl1nIzvn,Tnl1nMont,Tnl1nMontPred,?,?,?,?>
;
			Stb     35
Gr69_1:   	Gr      <tnl1npOG,tnl1npAV,Ftnl1npIzvt,Ftnl1npIzvn,Tnl1npMont,Tnl1npMontPred,tnl2nOG,tnl2nAV>
Gr6A_1:   	Gr      <Ftnl2nIzvt,Ftnl2nIzvn,Tnl2nMont,Tnl2nMontPred,tnl2npOG,tnl2npAV,Ftnl2npIzvt,Ftnl2npIzvn>
Gr6B_1:     Gr      <Tnl2npMont,Tnl2npMontPred,uks1npp1,uks1npp2,?,?,?,?>  
; 
			Stb     36   
Gr6C_1:   	Gr      <uks1nppKz,uks1tup1,uks1tup2,uks1tupKz,uks2nup1,uks2nup2,uks2nupKz,uks2tpp1>                					 
Gr6D_1:   	Gr      <uks2tpp2,uks2tppKz,uks1t1tup1,uks1t1tup2,uks1t1tupKz,uks1t2tpp1,uks1t2tpp2,uks1t2tppKz>                                    
Gr6E_1:     Gr      <uks2t1tup1,uks2t1tup2,uks2t1tupKz,uks2t2tpp1,?,?,?,?>                                    
;                                                                       
			Stb     37
Gr6F_1:   	Gr      <uks2t2tpp2,uks2t2tppKz,uks1n1tup1,uks1n1tup2,uks1n1tupKz,uks1n2tpp1,uks1n2tpp2,uks1n2tppKz>									 
Gr70_1:   	Gr      <t1kgu,t1kguKZ,t2kgu,t2kguKZ,n1kgu,n1kguKZ,n2kgu,n2kguKZ>
Gr71_1:     Gr      <spm8tp,Kdsp,Kdnc,Kzdncsu,?,?,?,?> ;+
;
			Stb     38 ;+
Gr72_1:   	Gr      <Kkru,Ksostu1,Ksostu2,KzdncDu,Knezak,Kizkg,Kmak,Kizd>
Gr73_1:   	Gr      <kzp,Kbld,Kir,Kobrdc,?,?,?,?>
Gr74_1:     Gr      <Kmont,keo1,ki1,keo2,?,?,?,?>
;
			Stb     39 ;+
Gr75_1:   	Gr      <ki2,keo3,ki3,keo4,ki4,?,?,?>
Gr76_1:   	Gr      <?,?,?,?,?,?,?,?>
Gr77_1:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     40 ;+
Gr78_1:   	Gr      <?,?,?,?,?,?,?,?>
Gr79_1:   	Gr      <?,Knpt,Kpt,Kvsp,Kawt,Kn1f,Kn2f,Kdgaz>
Gr7A_1:     Gr      <Krf1,Krf2,Kdga,Kpp,?,?,?,?>
;
			Stb     41 ;+
Gr7B_1:   	Gr      <kiz,Kden,Kdsn,Ktop,Kobsostl,Kobsost,Kp1ksu1,Kp2Ksu1>
Gr7C_1:   	Gr      <Kp1Ksu2,Kp2Ksu2,K2rm3,K2rm2,K2rm1,K1rm3,K1rm2,K1rm1>
Gr7D_1:     Gr      <?,?,K2ds,K1ds,?,?,?,?>
;
			Stb     42
Gr7E_1:   	Gr      <?,?,?,?,?,?,?,?>		;не добавлен обрыв кабеля
Gr7F_1:   	Gr      <?,?,?,?,?,?,?,?>       ;не добавлен обрыв кабеля
Gr80_1:     Gr      <?,?,?,?,?,?,?,?>       ;не добавлен обрыв кабеля
; 
			Stb     43 ;+
Gr81_1:   	Gr      <?,?,?,?,?,?,?,?>		;не добавлен обрыв кабеля
Gr82_1:   	Gr      <?,?,?,?,kog,kad,Kzam,Km>
Gr83_1:     Gr      <Kmu,Kuwo,ktsaut,knsaut,?,?,?,?>
; 
			Stb     44 ;+
Gr84_1:   	Gr      <KKgn,KuKsps,?,?,?,?,Kuvk,Kruvk>
Gr85_1:   	Gr      <?,most1_Zg,most1_PrAv,?,?,?,?,?>						  ;контроль моста не все сигналы добавлены
Gr86_1:     Gr      <?,most1_RRmont,?,most1_Mont,?,?,?,?>					  ;контроль моста не все сигналы добавлены
; 
			Stb     45
Gr87_1:   	Gr      <?,most2_Zg,most2_PrAv,?,?,?,?,?>						  ;контроль моста не все сигналы добавлены
Gr88_1:   	Gr      <?,most2_RRmont,?,most2_Mont,?,most_Zg,most_PrAv,?>       ;контроль моста не все сигналы добавлены
Gr89_1:     Gr      <?,?,?,?,?,?,?,?>										  ;контроль моста не все сигналы добавлены
;
			Stb     46
Gr8A_1:   	Gr      <?,most_RRmont,?,most_Mont,?,?,?,?>						  ;контроль моста не все сигналы добавлены
Gr8B_1:   	Gr      <?,?,?,?,?,?,?,?>           							  ;контроль моста не все сигналы добавлены
Gr8C_1:     Gr      <?,?,?,?,?,?,?,?>										  ;контроль моста не все сигналы добавлены
;------------------------------------------------
        	EndGr   KU1
;------------------------------------------------
;------------------------------------------------
        	BegGr   KU2
;------------------------------------------------
        	Stb 01
Gr03_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr04_2:   	Gr      <t1p+ABTCsh,?,?,?,t3p+ABTCsh,?,?,?>
Gr05_2:   	Gr      <t5p+ABTCsh,?,?,?,?,?,?,?>
    
        	Stb 02
Gr06_2:   	Gr      <t7p+ABTCsh,?,?,?,t9p+ABTCsh,?,?,?>
Gr07_2:   	Gr      <t11p+ABTCsh,?,?,?,t13p+ABTCsh,?,?,?>
Gr08_2:   	Gr      <t15p+ABTCsh,?,?,?,?,?,?,?>
    
         	Stb 03 
Gr09_2:   	Gr      <t17p+ABTCsh,?,?,?,t19p+ABTCsh,?,?,?>
Gr0A_2:   	Gr      <t21p+ABTCsh,?,?,?,t23p+ABTCsh,?,?,?>
Gr0B_2:   	Gr      <t25p+ABTCsh,?,?,?,?,?,?,?>
  	
       	    Stb 04
Gr0C_2:   	Gr      <t27p+ABTCsh,?,?,?,t29p+ABTCsh,?,?,?>
Gr0D_2:   	Gr      <t31p+ABTCsh,?,?,?,t33p+ABTCsh,?,?,?>
Gr0E_2:   	Gr      <t35p+ABTCsh,?,?,?,?,?,?,?>
    
			Stb 05
Gr0F_2:   	Gr      <t37p+ABTCsh,?,?,?,t39p+ABTCsh,?,?,?>
Gr10_2:   	Gr      <t41p+ABTCsh,?,?,?,t43p+ABTCsh,?,?,?>
Gr11_2:   	Gr      <t45p+ABTCsh,?,?,?,?,?,?,?>
                    
        	Stb 06  
Gr12_2:   	Gr      <t47p+ABTCsh,?,?,?,t49p+ABTCsh,?,?,?>
Gr13_2:   	Gr      <t51p+ABTCsh,?,?,?,t53p+ABTCsh,?,?,?>
Gr14_2:   	Gr      <t55p+ABTCsh,?,?,?,?,?,?,?>
                    
         	Stb 07  
Gr15_2:   	Gr      <t57p+ABTCsh,?,?,?,t59p+ABTCsh,?,?,?>
Gr16_2:   	Gr      <t61p+ABTCsh,?,?,?,t63p+ABTCsh,?,?,?>
Gr17_2:   	Gr      <t65p+ABTCsh,?,?,?,?,?,?,?>
  	                
         	Stb 08  
Gr18_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr19_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr1A_2:   	Gr      <?,?,?,?,?,?,?,?>

	    	Stb		9
Gr1B_2:		Gr		<?,?,?,?,?,?,?,?>
Gr1C_2:   	Gr		<?,?,?,?,?,?,?,?>
Gr1D_2:		Gr		<?,?,?,?,?,?,?,?>
;	        
	    	Stb		10
Gr1E_2:   	Gr		<?,?,?,?,?,?,?,?>
Gr1F_2:		Gr		<?,?,?,?,?,?,?,?>
Gr20_2:   	Gr		<?,?,?,?,?,?,?,?>
;
	    	Stb		11
Gr21_2:   	Gr		<?,?,?,?,?,?,?,?>
Gr22_2:		Gr		<?,?,?,?,?,?,?,?>
Gr23_2:   	Gr		<?,?,?,?,?,?,?,?>
;	        
	    	Stb		12
Gr24_2:   	Gr		<?,?,?,?,t67p+ABTCsh,?,?,?>
Gr25_2:		Gr		<t69p+ABTCsh,?,?,?,t71p+ABTCsh,?,?,?>
Gr26_2:   	Gr		<t73p+ABTCsh,?,?,?,?,?,?,?>
;
	    	Stb		13
Gr27_2:   	Gr		<t75p+ABTCsh,?,?,?,t77p+ABTCsh,?,?,?>
Gr28_2:		Gr		<t79p+ABTCsh,?,?,?,t81p+ABTCsh,?,?,?>
Gr29_2:		Gr      <t83p+ABTCsh,?,?,?,?,?,?,?>
;
	    	Stb		14
Gr2A_2:		Gr      <t85p+ABTCsh,?,?,?,t87p+ABTCsh,?,?,?>
Gr2B_2:   	Gr		<t89p+ABTCsh,?,?,?,t91p+ABTCsh,?,?,?>
Gr2C_2:		Gr		<t93p+ABTCsh,?,?,?,?,?,?,?>
;
   			Stb		15
Gr2D_2:		Gr		<t95p+ABTCsh,?,?,?,t97p+ABTCsh,?,?,?>
Gr2E_2:   	Gr		<t99p+ABTCsh,?,?,?,t101p+ABTCsh,?,?,?>
Gr2F_2:		Gr		<t103p+ABTCsh,?,?,?,?,?,?,?>
;
   			Stb		16
Gr30_2:		Gr		<t105p+ABTCsh,?,?,?,t107p+ABTCsh,?,?,?>
Gr31_2:   	Gr		<t109p+ABTCsh,?,?,?,t111p+ABTCsh,?,?,?>
Gr32_2:		Gr		<t113p+ABTCsh,?,?,?,?,?,?,?>
;
   			Stb		17
Gr33_2:		Gr		<t115p+ABTCsh,?,?,?,t117p+ABTCsh,?,?,?>
Gr34_2:   	Gr		<t119p+ABTCsh,?,?,?,t121p+ABTCsh,?,?,?>
Gr35_2:		Gr		<t123p+ABTCsh,?,?,?,?,?,?,?>
;	
	    	Stb		18
Gr36_2:		Gr		<t125p+ABTCsh,?,?,?,t127p+ABTCsh,?,?,?>
Gr37_2:   	Gr		<t129p+ABTCsh,?,?,?,t131p+ABTCsh,?,?,?> ;заканчиваются РЦ
Gr38_2:		Gr		<?,?,?,?,?,?,?,?>
;	
	    	Stb		19
Gr39_2:		Gr		<?,?,?,?,?,?,?,?>
Gr3A_2:   	Gr		<?,?,?,?,?,?,?,?>
Gr3B_2:		Gr		<?,?,?,?,?,?,?,?>
;
	    	Stb		20
Gr3C_2:		Gr		<?,?,?,?,?,?,?,?>
Gr3D_2:		Gr      <?,?,?,?,?,?,?,?>
Gr3E_2:		Gr		<?,?,?,?,?,?,?,?>
;
	       	Stb     21
Gr3F_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr40_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr41_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     22                                                               
Gr42_2:   	Gr      <?,?,?,?,t2p+ABTCsh,?,?,?>
Gr43_2:   	Gr      <t4p+ABTCsh,?,?,?,t6p+ABTCsh,?,?,?>
Gr44_2:     Gr      <t8p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     23
Gr45_2:   	Gr      <t10p+ABTCsh,?,?,?,t12p+ABTCsh,?,?,?>
Gr46_2:   	Gr      <t14p+ABTCsh,?,?,?,t16p+ABTCsh,?,?,?>
Gr47_2:     Gr      <t18p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     24
Gr48_2:   	Gr      <t20p+ABTCsh,?,?,?,t22p+ABTCsh,?,?,?>
Gr49_2:   	Gr      <t24p+ABTCsh,?,?,?,t26p+ABTCsh,?,?,?>
Gr4A_2:     Gr      <t28p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     25
Gr4B_2:   	Gr      <t30p+ABTCsh,?,?,?,t32p+ABTCsh,?,?,?>
Gr4C_2:   	Gr      <t34p+ABTCsh,?,?,?,t36p+ABTCsh,?,?,?>
Gr4D_2:     Gr      <t38p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     26
Gr4E_2:   	Gr      <t40p+ABTCsh,?,?,?,t42p+ABTCsh,?,?,?>
Gr4F_2:   	Gr      <t44p+ABTCsh,?,?,?,t46p+ABTCsh,?,?,?>
Gr50_2:     Gr      <t48p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     27
Gr51_2:   	Gr      <t50p+ABTCsh,?,?,?,t52p+ABTCsh,?,?,?>
Gr52_2:   	Gr      <t54p+ABTCsh,?,?,?,t56p+ABTCsh,?,?,?>
Gr53_2:     Gr      <t58p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     28
Gr54_2:   	Gr      <t60p+ABTCsh,?,?,?,t62p+ABTCsh,?,?,?>
Gr55_2:   	Gr      <t64p+ABTCsh,?,?,?,t66p+ABTCsh,?,?,?>
Gr56_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     29
Gr57_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr58_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr59_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     30
Gr5A_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr5B_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr5C_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     31
Gr5E_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr5F_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr60_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     32
Gr61_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr62_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr63_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     33
Gr64_2:   	Gr      <t68p+ABTCsh,?,?,?,t70p+ABTCsh,?,?,?>
Gr65_2:   	Gr      <t72p+ABTCsh,?,?,?,t74p+ABTCsh,?,?,?>
Gr66_2:     Gr      <t76p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     34
Gr67_2:   	Gr      <t78p+ABTCsh,?,?,?,t80p+ABTCsh,?,?,?>
Gr68_2:   	Gr      <t82p+ABTCsh,?,?,?,t84p+ABTCsh,?,?,?>
Gr69_2:     Gr      <t86p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     35
Gr6A_2:   	Gr      <t88p+ABTCsh,?,?,?,t90p+ABTCsh,?,?,?>
Gr6B_2:   	Gr      <t92p+ABTCsh,?,?,?,t94p+ABTCsh,?,?,?>
Gr6C_2:     Gr      <t96p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     36
Gr6D_2:   	Gr      <t98p+ABTCsh,?,?,?,t100p+ABTCsh,?,?,?>
Gr6E_2:   	Gr      <t102p+ABTCsh,?,?,?,t104p+ABTCsh,?,?,?>
Gr6F_2:     Gr      <t106p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     37
Gr70_2:   	Gr      <t108p+ABTCsh,?,?,?,t110p+ABTCsh,?,?,?>
Gr71_2:   	Gr      <t112p+ABTCsh,?,?,?,t114p+ABTCsh,?,?,?>
Gr72_2:     Gr      <t116p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     38
Gr73_2:   	Gr      <t118p+ABTCsh,?,?,?,t120p+ABTCsh,?,?,?>
Gr74_2:   	Gr      <t122p+ABTCsh,?,?,?,t124p+ABTCsh,?,?,?>
Gr75_2:     Gr      <t126p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     39
Gr76_2:   	Gr      <t128p+ABTCsh,?,?,?,t130p+ABTCsh,?,?,?>
Gr77_2:   	Gr      <t132p+ABTCsh,?,?,?,?,?,?,?>
Gr78_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     40
Gr79_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr7A_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr7B_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     41
Gr7C_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr7D_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr7E_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     42
Gr7F_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr80_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr81_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     43
Gr82_2:   	Gr      <n1p+ABTCsh,?,?,?,n3p+ABTCsh,?,?,?>
Gr83_2:   	Gr      <n5p+ABTCsh,?,?,?,n7p+ABTCsh,?,?,?>
Gr84_2:     Gr      <n9p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     44
Gr85_2:   	Gr      <n11p+ABTCsh,?,?,?,n13p+ABTCsh,?,?,?>
Gr86_2:   	Gr      <n15p+ABTCsh,?,?,?,n17p+ABTCsh,?,?,?>
Gr87_2:     Gr      <n19p+ABTCsh,?,?,?,?,?,?,?>
;
			Stb     45
Gr88_2:   	Gr      <n21p+ABTCsh,?,?,?,n23p+ABTCsh,?,?,?>
Gr89_2:   	Gr      <n25p+ABTCsh,?,?,?,n27p+ABTCsh,?,?,?>
Gr8A_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     46
Gr8B_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr8C_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr8D_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     47
Gr8E_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr8F_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr90_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     48
Gr91_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr92_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr93_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     49
Gr94_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr95_2:   	Gr      <?,?,n2p+ABTCsh,?,?,?,n4p+ABTCsh,?>
Gr96_2:     Gr      <?,?,n6p+ABTCsh,?,?,?,?,?>
;
			Stb     50
Gr97_2:   	Gr      <?,?,n8p+ABTCsh,?,?,?,n10p+ABTCsh,?>
Gr98_2:   	Gr      <?,?,n12p+ABTCsh,?,?,?,n14p+ABTCsh,?>
Gr99_2:     Gr      <?,?,n16p+ABTCsh,?,?,?,?,?>
;
			Stb     51
Gr9A_2:   	Gr      <?,?,n18p+ABTCsh,?,?,?,n20p+ABTCsh,?>
Gr9B_2:   	Gr      <?,?,n22p+ABTCsh,?,?,?,n24p+ABTCsh,?>
Gr9C_2:     Gr      <?,?,n26p+ABTCsh,?,?,?,?,?>
;
			Stb     52
Gr9D_2:   	Gr      <?,?,n28p+ABTCsh,?,?,?,?,?>
Gr9E_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr9F_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     53
Gr100_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr101_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr102_2:     Gr      <?,?,?,?,?,?,?,?>
;
			Stb     54
Gr103_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr104_2:   	Gr      <?,?,?,?,?,?,?,?>
Gr105_2:     Gr      <?,?,?,?,?,?,?,?>
;------------------------------------------------
        	EndGr   KU2
;------------------------------------------------
;       	Описание блоков РКП-ТС
;------------------------------------------------
			BegTS KU1
;-----------------------------------------------------------------------------------
Ts1_1:  BlkTs 01,'ЭЦ-ЕМ   '
        GrpTs   <'1НМСО     ','1НСИБ     ','1НС       ','1НПС      ','1НКО      '>
        GrpTs   <'1НАД      ','1НТЕМН    ','1ЧМСО     ','1ЧСИБ     ','1ЧС       '>
        GrpTs   <'1ЧПС      ','1ЧКО      ','1ЧАД      ','1ЧТЕМН    ','2НМСО     '>
        GrpTs   <'2НСИБ     ','2НС       ','2НПС      ','2НКО      ','2НАД      '>
Ts2_1:  BlkTs 02,'ЭЦ-ЕМ   '
        GrpTs   <'2НТЕМН    ','2ЧМСО     ','2ЧСИБ     ','2ЧС       ','2ЧПС      '>
        GrpTs   <'2ЧКО      ','2ЧАД      ','2ЧТЕМН    ','М1С       ','М1О       '>
        GrpTs   <'М1СИБ     ','М1ЗАГР    ','М2С       ','М2О       ','М2СИБ     '>
        GrpTs   <'М2ЗАГР    ','М3С       ','М3О       ','М3СИБ     ','М35ЗАГР   '>
Ts3_1:  BlkTs 03,'ЭЦ-ЕМ   '
        GrpTs   <'М4С       ','М4О       ','М4СИБ     ','М4ЗАГР    ','М5С       '>
        GrpTs   <'М5О       ','М5СИБ     ','М5ЗАГР    ','М6С       ','М6О       '>
        GrpTs   <'М6СИБ     ','М6ЗАГР    ','М7С       ','М7О       ','М7СИБ     '>
        GrpTs   <'М7ЗАГР    ','М8С       ','М8О       ','М8СИБ     ','М8ЗАГР    '>
Ts4_1:  BlkTs 04,'ЭЦ-ЕМ   '
        GrpTs   <'М9С       ','М9О       ','М9СИБ     ','М9ЗАГР    ','М10С      '>
        GrpTs   <'М10О      ','М10СИБ    ','М10ЗАГР   ','М11С      ','М11О      '>
        GrpTs   <'М11СИБ    ','М11ЗАГР   ','Н1МС      ','Н1МСО     ','Н1СИБ     '>
        GrpTs   <'Н1С       ','Н1ПС      ','Н1АД      ','Н1ЗАГР    ','Н2МС      '>
Ts5_1:  BlkTs 05,'ЭЦ-ЕМ   '
        GrpTs   <'Н2МСО     ','Н2СИБ     ','Н2С       ','Н2ПС      ','Н2АД      '>
        GrpTs   <'Н2ЗАГР    ','Н3МС      ','Н3МСО     ','Н3СИБ     ','Н3С       '>
        GrpTs   <'Н3ПС      ','Н3АД      ','Н3ЗАГР    ','Н4МС      ','Н4МСО     '>
        GrpTs   <'Н4СИБ     ','Н4С       ','Н4ПС      ','Н4АД      ','Н4ЗАГР    '>
Ts6_1:  BlkTs 06,'ЭЦ-ЕМ   '   
        GrpTs   <'Н6МС      ','Н6МСО     ','Н6СИБ     ','Н6С       ','Н6ПС      '>
        GrpTs   <'Н6АД      ','Н6ЗАГР    ','НКЮМСО    ','НКЮСИБ    ','НКЮС      '>
        GrpTs   <'НКЮПС     ','НКЮКО     ','НКЮАД     ','НКЮТЕМН   ','Ч1МС      '>
        GrpTs   <'Ч1МСО     ','Ч1СИБ     ','Ч1С       ','Ч1ПС      ','Ч1АД      '>
Ts7_1:  BlkTs 07,'ЭЦ-ЕМ   '
        GrpTs   <'Ч1ЗАГР    ','Ч2МС      ','Ч2МСО     ','Ч2СИБ     ','Ч2С       '>
        GrpTs   <'Ч2ПС      ','Ч2АД      ','Ч2ЗАГР    ','Ч3МС      ','Ч3МСО     '>
        GrpTs   <'Ч3СИБ     ','Ч3С       ','Ч3ПС      ','Ч3АД      ','Ч3ЗАГР    '>
        GrpTs   <'Ч4МС      ','Ч4МСО     ','Ч4СИБ     ','Ч4С       ','Ч4ПС      '>
Ts8_1:  BlkTs 08,'ЭЦ-ЕМ   '
        GrpTs   <'Ч4АД      ','Ч4ЗАГР    ','Ч6МС      ','Ч6МСО     ','Ч6СИБ     '>
        GrpTs   <'Ч6С       ','Ч6ПС      ','Ч6АД      ','Ч6ЗАГР    ','ЧКЮМСО    '>
        GrpTs   <'ЧКЮСИБ    ','ЧКЮС      ','ЧКЮПС     ','ЧКЮКО     ','ЧКЮАД     '>
        GrpTs   <'ЧКЮТЕМН   ','1ПК       ','1МК       ','1АВК      ','1МОНТ     '>
Ts9_1:  BlkTs 09,'ЭЦ-ЕМ   '
        GrpTs   <'1ОМ       ','1ИЗ       ','1ОЧПУСК   ','1СКНГ     ','2ПК       '>
        GrpTs   <'2МК       ','2АВК      ','2МОНТ     ','2ОМ       ','2ИЗ       '>
        GrpTs   <'2ОЧПУСК   ','2СКНГ     ','3ПК       ','3МК       ','3АВК      '>
        GrpTs   <'3МОНТ     ','3ОМ       ','3ИЗ       ','3ОЧПУСК   ','3СКГН     '>
Ts10_1: BlkTs 10,'ЭЦ-ЕМ   '
        GrpTs   <'4ПК       ','4МК       ','4АВК      ','4МОНТ     ','4ОМ       '>
        GrpTs   <'4ИЗ       ','4ОЧПУСК   ','4СКНГ     ','5ПК       ','5МК       '>
        GrpTs   <'5АВК      ','5МОНТ     ','5ОМ       ','5ИЗ       ','5ОЧПУСК   '>
        GrpTs   <'5СКНГ     ','6ПК       ','6МК       ','6АВК      ','6МОНТ     '>
Ts11_1: BlkTs 11,'ЭЦ-ЕМ   '
        GrpTs   <'6ОМ       ','6ИЗ       ','6ОЧПУСК   ','6СКНГ     ','7ПК       '>
        GrpTs   <'7МК       ','7АВК      ','7МОНТ     ','7ОМ       ','7ИЗ       '>
        GrpTs   <'7ОЧПУСК   ','7СКНГ     ','8ПК       ','8МК       ','8АВК      '>
        GrpTs   <'8МОНТ     ','8ОМ       ',' 8ИЗ      ','8ОЧПУСК   ','8СКГН     '>
Ts12_1: BlkTs 12,'ЭЦ-ЕМ   '
        GrpTs   <'9ПК       ','9МК       ',' 9АВК     ','9МОНТ     ','9ОМ       '>
        GrpTs   <'9ИЗ       ','9ОЧПУСК   ','9СКНГ     ','10ПК      ','10МК      '>
        GrpTs   <'10АВК     ','10МОНТ    ','10ОМ      ','10ИЗ      ','10ОЧПУСК  '>
        GrpTs   <'10СКНГ    ','11ПК      ','11МК      ','11АВК     ','11МОНТ    '>
Ts13_1:   BlkTs 13,'ЭЦ-ЕМ   '
        GrpTs   <'11ОМ      ','11ИЗ      ','11ОЧПУСК  ','11СКНГ    ','12ПК      '>
        GrpTs   <'12МК      ','12АВК     ','12МОНТ    ','12ОМ      ','12ИЗ      '>
        GrpTs   <'12ОЧПУСК  ','12СКНГ    ','13ПК      ','13МК      ','13АВК     '>
        GrpTs   <'13МОНТ    ','13ОМ      ','13ИЗ      ','13ОЧПУСК  ','13СКГН    '>
Ts14_1: BlkTs 14,'ЭЦ-ЕМ   '
        GrpTs   <'14ПК      ','14МК      ','14АВК     ','14МОНТ    ','14ОМ      '>
        GrpTs   <'14ИЗ      ','14ОЧПУСК  ','14СКНГ    ','15ПК      ','15МК      '>
        GrpTs   <'15АВК     ','15МОНТ    ','15ОМ      ','15ИЗ      ','15ОЧПУСК  '>
        GrpTs   <'15СКНГ    ','16ПК      ','16МК      ','16АВК     ','16МОНТ    '>
Ts15_1: BlkTs 15,'ЭЦ-ЕМ   '
        GrpTs   <'16ОМ      ','16ИЗ      ','16ОЧПУСК  ','16СКНГ    ','17ПК      '>
        GrpTs   <'17МК      ','17АВК     ','17МОНТ    ','17ОМ      ','17ИЗ      '>
        GrpTs   <'17ОЧПУСК  ','17СКНГ    ','19ПК      ','19МК      ','19АВК     '>
        GrpTs   <'19МОНТ    ','19ОМ      ','19ИЗ      ','19ОЧПУСК  ','19СКГН    '>
Ts16_1: BlkTs 16,'ЭЦ-ЕМ   '
        GrpTs   <'1СПЗ      ','1СПРИ     ','1СПСП     ','1СПЛОГЗ   ','1СПОГ     '>
        GrpTs   <'1СПЧСК    ','1СПНСК    ','1СПЗАН    ','1СПВОБ    ','1СПМАК    '>
        GrpTs   <'1СПМАКЕТ  ','1СПЗАМ    ','2СПЗ      ','2СПРИ     ','2СПСП     '>
        GrpTs   <'2СПЛОГЗ   ','2СПОГ     ','2СПЧСК    ','2СПНСК    ',' 2СПЗАНМСП'>
Ts17_1: BlkTs 17,'ЭЦ-ЕМ   '
        GrpTs   <'2СПВОБ    ','2СПМАК    ','2СПМАК    ','2СПЗАМ    ','3-7СПЗ    '>
        GrpTs   <'3-7СПРИ   ','3-7СПСП   ','3-7СПЛОГЗ ','3-7СПОГ   ','3-7СПЧСК  '>
        GrpTs   <'3-7СПНСК  ','3-7СПЗАН  ','3-7СПВОБ  ','3-7СПМАК  ','3-7СПМАКЕТ'>
        GrpTs   <'3-7СПЗАМ  ','4СПЗ      ','4СПРИ     ','4СПСП     ',' 4СПЛОГЗ  '>
Ts18_1: BlkTs 18,'ЭЦ-ЕМ   '
        GrpTs   <'4СПОГ     ','4СПЧСК    ','4СПНСК    ','4СПЗАН    ','4СПВОБ    '>
        GrpTs   <'4СПМАК    ','4СПМАК    ','4СПЗАМ    ','5СПЗ      ','5СПРИ     '>
        GrpTs   <'5СПСП     ','5СПЛОГЗ   ','5СПОГ     ','5СПЧСК    ','5СПНСК    '>
        GrpTs   <'5СПЗАН    ','5СПВОБ    ','5СПМАК    ','5СПМАК    ','5СПЗАМ    '>
Ts19_1: BlkTs 19,'ЭЦ-ЕМ   '
        GrpTs   <'6-10СПЗ   ','6-10СПРИ  ','6-10СПСП  ','6-10СПЛОГЗ','6-10СПОГ  '>
        GrpTs   <'6-10СПЧСК ','6-10СПНСК ','6-10СПЗАН ','6-10СПВОБ ','6-10СПМАК '>
        GrpTs   <'6-10СПМАК ','6-10СПЗАМ ','8-14СПЗ   ','8-14СПРИ  ','8-14СПСП  '>
        GrpTs   <'8-14СПЛОГЗ','8-14СПОГ  ','8-14СПЧСК ','8-14СПНСК ','8-14СПЗАНМ'>
Ts20_1: BlkTs 20,'ЭЦ-ЕМ   '
        GrpTs   <'8-14СПВОБ ','8-14СПМАК ','8-14СПМАК ','8-14СПЗАМ ','9-13СПЗ   '>
        GrpTs   <'9-13СПРИ  ','9-13СПСП  ','9-13СПЛОГЗ','9-13СПОГ  ','9-13СПЧСК '>
        GrpTs   <'9-13СПНСК ','9-13СПЗАН ','9-13СПВОБ ','9-13СПМАК ','9-13СПМАК '>
        GrpTs   <'9-13СПЗАМ ','11-17СПЗ  ','11-17СПРИ ','11-17СПСП ','11-17СПЛОГ'>
Ts21_1: BlkTs 21,'ЭЦ-ЕМ   '
        GrpTs   <'11-17СПОГ ','11-17СПЧСК','11-17СПНСК','11-17СПНМ ','11-17СПВОБ'>
        GrpTs   <'11-17СПМАК','11-17СПМАК','11-17СПЗАМ','12-16СПЗ  ','12-16СПРИ '>
        GrpTs   <'12-16СПСП ','12-16СПЛОГ','12-16СПОГ ','12-16СПЧСК','12-16СПНСК'>
        GrpTs   <'12-16СПНМ ','12-16СПВОБ','12-16СПМАК','12-16СПМАК','12-16СПЗАМ'>
Ts22_1: BlkTs 22,'ЭЦ-ЕМ   '
        GrpTs   <'15-19СПЗ  ','15-19СПРИ ','15-19СПСП ','15-19СПЛОГ','15-19СПОГ '>
        GrpTs   <'15-19СПЧСК','15-19СПНСК','15-19СПНМ ','15-19СПВОБ','15-19СПМАК'>
        GrpTs   <'15-19СПМАК','15-19СПЗАМ','1НПЗ      ','1НПРИ     ','1НПСП     '>
        GrpTs   <'1НПЛОГЗ   ','1НПЧСК    ','1НПНСК    ','1НПНМ     ','1НПВОБ    '>
Ts23_1: BlkTs 23,'ЭЦ-ЕМ   '
        GrpTs   <'1НПМАК    ','1НПМАК    ','1НПЗАМ    ','1ЧПЗ      ','1ЧПРИ     '>
        GrpTs   <'1ЧПСП     ','1ЧПЛОГЗ   ','1ЧПЧСК    ','1ЧПНСК    ','1ЧПНМ     '>
        GrpTs   <'1ЧПВОБ    ','1ЧПМАК    ','1ЧПМАКЕТ  ','1ЧПЗАМ    ','2НПЗ      '>
        GrpTs   <'2НПРИ     ','2НПСП     ','2НПЛОГЗ   ','2НПЧСК    ','2НПНСК    '>
Ts24_1: BlkTs 24,'ЭЦ-ЕМ   '
        GrpTs   <'2НПНМ     ','2НПВОБ    ','2НПМАК    ','2НПМАК    ','2НПЗАМ    '>
        GrpTs   <'2ЧПЗ      ','2ЧПРИ     ','2ЧПСП     ','2ЧПЛОГЗ   ','2ЧПЧСК    '>
        GrpTs   <'2ЧПНСК    ','2ЧПНМ     ','2ЧПВОБ    ','2ЧПМАК    ','2ЧПМАКЕТ  '>
        GrpTs   <'2ЧПЗАМ    ','НКЮАПЗ    ','НКЮАПРИ   ','НКЮАПСП   ','НКЮАПЛОГЗ '>
Ts25_1: BlkTs 25,'ЭЦ-ЕМ   '
        GrpTs   <'НКЮАПЧСК  ','НКЮАПНСК  ','НКЮАПНМ   ','НКЮАПВОБ  ','НКЮАПМАК  '>
        GrpTs   <'НКЮАПМАК  ','НКЮАПЗАМ  ','Ч1П-1ЧУПП ','Ч1П-1ЧУПН ','Ч3П-1ЧУПП '>
        GrpTs   <'Ч3П-1ЧУПНМ','Ч5П-1ЧУПП ','Ч5П-1ЧУПНМ','Ч7П-1ЧУПП ','Ч7П-1ЧУПН '>
        GrpTs   <'Ч9П-1ЧУПП ','Ч9П-1ЧУПН ','Ч11П-1ЧУПП','Ч11П-1ЧУПН','Ч13П-1ЧУПП'>
Ts26_1: BlkTs 26,'ЭЦ-ЕМ   '
        GrpTs   <'Ч13П-1ЧУПН','Ч15П-1ЧУПП','Ч15П-1ЧУПН','Ч17П-1ЧУПП','Ч17П-1ЧУПН'>
        GrpTs   <'Ч19П-1ЧУПП','Ч19П-1ЧУПН','Ч2П-2ЧППП ','Ч2П-2ЧППН ','Ч4П-2ЧППП '>
        GrpTs   <'Ч4П-2ЧППНМ','Ч6П-2ЧППП ','Ч6П-2ЧППНМ','Ч8П-2ЧППП ',' Ч8П-2ЧППН'>
        GrpTs   <'Ч10П-2ЧППП','Ч10П-2ЧППН','Ч12П-2ЧППП','Ч12П-2ЧППН','Ч14П-2ЧППП'>
Ts27_1: BlkTs 27,'ЭЦ-ЕМ   '
        GrpTs   <'Ч14П-2ЧППН','Ч16П-2ЧППП','Ч16П-2ЧППН','Ч18П-2ЧППП','Ч18П-2ЧППН'>
        GrpTs   <'Ч20П-2ЧППП','Ч20П-2ЧППН','Н1П-1НППП ','Н1П-1НППН ','Н3П-1НППП '>
        GrpTs   <'Н3П-1НППНМ','Н5П-1НППП ','Н5П-1НППНМ','Н7П-1НППП ',' Н7П-1НППН'>
        GrpTs   <'Н9П-1НППП ','Н9П-1НППН ','Н2П-2НУПП ','Н2П-2НУПН ','Н4П-2НУПП '>
Ts28_1: BlkTs 28,'ЭЦ-ЕМ   '
        GrpTs   <'Н4П-2НУПН ','Н6П-2НУПП ','Н6П-2НУПН ','Н8П-2НУПП ','Н8П-2НУПН '>
        GrpTs   <'Н10П-2НУПП','Н10П-2НУПН','1ПЗ       ','1ППОГ     ','1ПП       '>
        GrpTs   <'1ПЛОГЗ    ','1ПЧСК     ','1ПНСК     ','1ПНМ      ','1ПВОБ     '>
        GrpTs   <'1ПМАК     ','1ПМАК     ','1ПЗАМ     ','2ПЗ       ','2ППОГ     '>
Ts29_1: BlkTs 29,'ЭЦ-ЕМ   '
        GrpTs   <'2ПП       ','2ПЛОГЗ    ','2ПЧСК     ','2ПНСК     ','2ПНМ      '>
        GrpTs   <'2ПВОБ     ','2ПМАК     ','2ПМАКЕТ   ','2ПЗАМ     ','3ПЗ       '>
        GrpTs   <'3ППОГ     ','3ПП       ','3ПЛОГЗ    ','3ПЧСК     ','3ПНСК     '>
        GrpTs   <'3ПНМ      ','3ПВОБ     ','3ПМАК     ','3ПМАК     ','3ПЗАМ     '>
Ts30_1: BlkTs 30,'ЭЦ-ЕМ   '
        GrpTs   <'4ПЗ       ','4ППОГ     ','4ПП       ','4ПЛОГЗ    ','4ПЧСК     '>
        GrpTs   <'4ПНСК     ','4ПНМ      ','4ПВОБ     ','4ПМАК     ','4ПМАК     '>
        GrpTs   <'4ПЗАМ     ','6ПЗ       ','6ППОГ     ','6ПП       ','6ПЛОГЗ    '>
        GrpTs   <'6ПЧСК     ','6ПНСК     ','6ПНМ      ','6ПВОБ     ','6ПМАК     '>
Ts31_1: BlkTs 31,'ЭЦ-ЕМ   '
        GrpTs   <'6ПМАК     ','6ПЗАМ     ','1НППО     ','1НПП1УП   ','1НПП2УП   '>
        GrpTs   <'1НПП3УП   ','1НППКП    ','1НППКЖ    ','1НППРО    ','1НППУПБ   '>
        GrpTs   <'1НППИ     ','          ','          ','          ','1ЧУПО     '>
        GrpTs   <'1ЧУП1УП   ','1ЧУП2УП   ','1ЧУП3УП   ','1ЧУПКП    ','1ЧУПКЖ    '>
Ts32_1: BlkTs 32,'ЭЦ-ЕМ   '
        GrpTs   <'1ЧУПРО    ','1ЧУПУПБ   ','1ЧУПИ     ','          ','          '>
        GrpTs   <'          ','2НУПО     ','2НУП1УП   ','2НУП2УП   ','2НУП3УП   '>
        GrpTs   <'2НУПКП    ','2НУПКЖ    ','2НУПРО    ','2НУПУПБ   ','2НУПИ     '>
        GrpTs   <'          ','          ','          ','2ЧППО     ','2ЧПП1УП   '>
Ts33_1: BlkTs 33,'ЭЦ-ЕМ   '
        GrpTs   <'2ЧПП2УП   ','2ЧПП3УП   ','2ЧППКП    ','2ЧППКЖ    ','2ЧППРО    '>
        GrpTs   <'2ЧППУПБ   ','2ЧППИ     ','          ','          ','          '>
        GrpTs   <'НЧКЮО     ','НЧКЮ1УП   ','НЧКЮ2УП   ','НЧКЮ3УП   ',' НЧКЮКП   '>
        GrpTs   <'НЧКЮКЖ    ','НЧКЮРО    ','НЧКЮУПБ   ','НЧКЮИ     ','          '>
Ts34_1: BlkTs 34,'ЭЦ-ЕМ   '
        GrpTs   <'          ','          ','ПАБОТПР   ','ПАБЗАНБУ1 ','ПАБЗАНПЕР '>
        GrpTs   <'ПАБФИКТКСБ','ПАБФИКТКСД','ПАБКЗК    ','ПАБКЖ     ','ПАБФП     '>
        GrpTs   <'ПАБФИКТПОС','ПАБПС     ','ПАБДСО    ','ПАБЗАНКПСО','ТОНН-1НОГ '>
        GrpTs   <'ТОН-1НН   ','ТОН-1НИЧ  ','ТОН-1НИН  ','ТОН-1НРРТ ','ТОН-1НОТР '>
Ts35_1: BlkTs 35,'ЭЦ-ЕМ   '
        GrpTs   <'ТНЭЦ-1НД  ','ТНЭЦ-1НН  ','ТНЭЦ-1НИЧ ','ТНЭЦ-1НИН ','ТНЭЦ-1НРР '>
        GrpTs   <'ТНЭЦ-1НРРТ','ТОН-2НОГ  ','ТОН-2НН   ','ТОН-2НИЧ  ','ТОН-2НИН  '>
        GrpTs   <'ТОН-2НРРТ ','ТОН-2НОТР ','ТНЭЦ-2НПОГ','ТНЭЦ-2НУПН','ТНЭЦ-2НУИЧ'>
        GrpTs   <'ТНЭЦ-2НУИН','ТНЭЦ-2НУРТ','ТНЭЦ-2НУТР','УКС-1НПб  ','УКС-1НПд  '>
Ts36_1: BlkTs 36,'ЭЦ-ЕМ   '
        GrpTs   <'УКС-1НПКЗ ','УКС-1ЧУб  ','УКС-1ЧУд  ','УКС-1ЧУКЗ ','УКС-2НУб  '>
        GrpTs   <'УКС-2НУд  ','УКС-2НУКЗ ','УКС-2ЧПб  ','УКС-2ЧПд  ','УКС-2ЧПКЗ '>
        GrpTs   <'УКС1Ч-1ЧУб','УКС1Ч-1Чд ','УКС1Ч-1ЧКЗ','УКС1Ч-2ЧПб','УКС1Ч-2ЧПд'>
        GrpTs   <'УКС1Ч-2ЧКЗ','УКС2Ч-1ЧУб','УКС2Ч-1ЧПд','УКС2Ч-1ЧКЗ','УКС2Ч-2ЧПб'>
Ts37_1: BlkTs 37,'ЭЦ-ЕМ   '
        GrpTs   <'УКС2Ч-2ЧПд','УКС2Ч-2ЧКЗ','УКС1Н-1ЧУб','УКС1Н-1ЧУд','УКС1Н-1ЧКЗ'>
        GrpTs   <'УКС1Н-2ЧПб','УКС1Н-2ЧПд','УКС1Н-2ЧКЗ','1ЧКГУБ    ','1ЧКГУКЗ   '>
        GrpTs   <'2ЧКГУБ    ','2ЧКГУКЗ   ','1НКГУСХОДБ','1НКГУКЗ   ','2НКГУБ    '>
        GrpTs   <'2НКГУКЗ   ','М8ПТП     ','ДСП       ','ДНЦ       ','ЗДНЦСУ    '>
Ts38_1: BlkTs 38,'ЭЦ-ЕМ   '
        GrpTs   <'КРУ       ','СОСТ_ТУ2  ','СОСТ_ТУ1  ','ЗДНЦДУ    ','ЕСТЬНЕЗАК '>
        GrpTs   <'ИЗКЖ      ','ЕСТЬМАК   ','ЕСТЬИЗД   ','ЕСТЬЗП    ','ЕСТЬБЛД   '>
        GrpTs   <'ЕСТЬИР    ','ОБРЫВДЦ   ','ЕСТЬЗАМКН ','ЕСТЬЗАН   ','ЧУЖНАПР   '>
        GrpTs   <'СТНЕСООТВ ','ЕСТЬМОНТ  ','МГЭОКЭО01 ','МГЭОКИ01  ','МГЭОКЭО02 '>
Ts39_1: BlkTs 39,'ЭЦ-ЕМ   '
        GrpTs   <'МГЭОКИ02  ','МГЭОКЭО03 ','МГЭОКИ03  ','МГЭОКЭО04 ','МГЭОКИ04  '>
        GrpTs   <'МГЭОКЭО05 ','МГЭОКИ05  ','МГЭОКЭО06 ','МГЭОКИ06  ','МГЭОКЭО07 '>
        GrpTs   <'МГЭОКИ07  ','МГЭОКЭО08 ','МГЭОКИ08  ','МГЭОКЭО09 ','МГЭОКИ09  '>
        GrpTs   <'МГЭОКЭО10 ','МГЭОКИ10  ','МГЭОКЭО11 ','МГЭОКИ11  ','МГЭОКЭО12 '>
Ts40_1: BlkTs 40,'ЭЦ-ЕМ   '
        GrpTs   <'МГЭОКИ12  ','МГЭОКЭО13 ','МГЭОКИ13  ','МГЭОКЭО14 ','МГЭОКИ14  '>
        GrpTs   <'МГЭОКЭО15 ','МГЭОКИ15  ','МГЭОКЭО16 ','МГЭОКИ16  ','МПИТНПТ   '>
        GrpTs   <'МПИТПТ    ','МПИТВСП   ','МПИТКАВТ  ','МПИТКН1Ф  ','МПИТКН2Ф  '>
        GrpTs   <'МПИТКН3Ф  ','МПИТКРФ1  ','МПИТКРФ2  ','МПИТКРФ3  ','МПИТПП    '>
Ts41_1: BlkTs 41,'ЭЦ-ЕМ   '
        GrpTs   <'МПИТИЗ    ','МПИТДН    ','МПИТДСН   ','МПИТТОП   ','ОБЩСОСТЛИН'>
        GrpTs   <'ОБЩСОСТ   ','КП1КСУ1   ','КП2КСУ1   ','КП1КСУ2   ','КП2КСУ2   '>
        GrpTs   <'К2РМ3     ','К2РМ2     ','К2РМ1     ','К1РМ3     ','К1РМ2     '>
        GrpTs   <'К1РМ1     ','К1К2С     ','К1К2Е     ','К2ДС      ','К1ДС      '>
Ts42_1: BlkTs 42,'ЭЦ-ЕМ   '
        GrpTs   <'ОБРЫВ01   ','КЗ01      ','ПИТРЦ01   ','НКОДРЦ01  ','ОБРЫВ02   '>
        GrpTs   <'КЗ02      ','ПИТРЦ02   ','КОДРЦ02   ','ОБРЫВ03   ','КЗ03      '>
        GrpTs   <'ПИТРЦ03   ','КОДРЦ03   ','ОБРЫВ04   ','КЗ04      ','ПИТРЦ04   '>
        GrpTs   <'КОДРЦ04   ','ОБРЫВ05   ','КЗ05      ','ПИТРЦ05   ','КОДРЦ05   '>
Ts43_1: BlkTs 43,'ЭЦ-ЕМ   '
        GrpTs   <'ОБРЫВ06   ','КЗ06      ','ПИТРЦ06   ','НКОДРЦ06  ','ОБРЫВ07   '>
        GrpTs   <'КЗ07      ','ПИТРЦ07   ','КОДРЦ07   ','ОБРЫВ08   ','КЗ08      '>
        GrpTs   <'ПИТРЦ08   ','КОДРЦ08   ','КОГ       ','КАД       ','КЗАМ      '>
        GrpTs   <'КМ        ','КМУ       ',' КУВО     ','КЧКСАУТ   ','КНКСАУТ   '>
Ts44_1: BlkTs 44,'ЭЦ-ЕМ   '
        GrpTs   <'ККГН      ','КУКСПС    ','          ','          ','          '>
        GrpTs   <'          ','КУВК      ','КРУВК     ','МОСТ1ИЗВЕЩ','МОСТ1ОГД  '>
        GrpTs   <'МОСТ1НЕИСП','МОСТ1НЕВОЗ','МОСТ1ЗАКР ','МОСТ1БЛАВТ','МОСТ1БЛКЖ '>
        GrpTs   <'МОСТ1ЕСТЬЛ','МОСТ1ДОС  ','МОСТ1РРТ  ','МОСТ1ОТРРТ','МОСТ1МОНТ '>
Ts45_1: BlkTs 45,'ЭЦ-ЕМ   '
        GrpTs   <'МОСТ2ИЗВЕЩ','МОСТ2ОГ   ','МОСТ2НЕИС ','МОСТ2НЕВО ','МОСТ2ЗАКРК'>
        GrpTs   <'МОСТ2БЛАВТ','МОСТ2БЛКЖ ','МОСТ2ЕСТЬЛ','МОСТ2ДОСТТ','МОСТ2РРТ  '>
        GrpTs   <'МОСТ2ОТРРТ','МОСТ2МОНТ ','МОСТИЗВЕЩ ','МОСТОГД   ','МОСТНЕИСПР'>
        GrpTs   <'МОСТНЕВОЗМ','МОСТЗАКРК ','МОСТБЛАВТ ','МОСТБЛКЖ  ','МОСТЕСТЬЛИ'>
Ts46_1: BlkTs 46,'ЭЦ-ЕМ   '
        GrpTs   <'МОСТДОСТТФ','МОСТРРТ   ','МОСТОТРРТ ','МОСТМОНТ  ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
			EndTS KU1
;--------------------------------------------------
			BegTS KU2
;--------------------------------------------------
Ts1_2:  BlkTs 01,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts2_2:  BlkTs 02,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts3_2:  BlkTs 03,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts4_2:  BlkTs 04,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts5_2:  BlkTs 05,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts6_2:  BlkTs 06,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts7_2:  BlkTs 07,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts8_2:  BlkTs 08,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts9_2:  BlkTs 09,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts10_2:  BlkTs 10,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts11_2:  BlkTs 11,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts12_2:  BlkTs 12,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts13_2:  BlkTs 13,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts14_2:  BlkTs 14,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts15_2:  BlkTs 15,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts16_2:  BlkTs 16,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts17_2:  BlkTs 17,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts18_2:  BlkTs 18,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts19_2:  BlkTs 19,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts20_2:  BlkTs 20,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts21_2:  BlkTs 21,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts22_2:  BlkTs 22,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts23_2:  BlkTs 23,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts24_2:  BlkTs 24,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts25_2:  BlkTs 25,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts26_2:  BlkTs 26,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts27_2:  BlkTs 27,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts28_2:  BlkTs 28,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts29_2:  BlkTs 29,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts30_2:  BlkTs 30,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts31_2:  BlkTs 31,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts32_2:  BlkTs 32,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts33_2:  BlkTs 33,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts34_2:  BlkTs 34,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts35_2:  BlkTs 35,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts36_2:  BlkTs 36,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts37_2:  BlkTs 37,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts38_2:  BlkTs 38,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts39_2:  BlkTs 39,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts40_2:  BlkTs 40,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts41_2:  BlkTs 41,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts42_2:  BlkTs 42,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts43_2:  BlkTs 43,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
Ts44_2:  BlkTs 44,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts45_2:  BlkTs 45,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts46_2:  BlkTs 46,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts47_2:  BlkTs 47,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts48_2:  BlkTs 48,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts49_2:  BlkTs 49,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts50_2:  BlkTs 50,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts51_2:  BlkTs 51,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts52_2:  BlkTs 52,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts53_2:  BlkTs 53,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>	
Ts54_2:  BlkTs 54,'АЛСО    '
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>
        GrpTs   <'          ','          ','          ','          ','          '>			
;--------------------------------------------------
		EndTS KU2		
;--------------------------------------------------
		EndStn	KUZ
;--------------------------------------------------
        END
