;
    	TITLE 'описание сигналов ст. Новочеркасск'
;**********************************************************
;       NNNN   NNNN VVVV  VVVV  CCCCCCC 
;        NNN    NN   VV    VV  CC     CC
;        NNNN   NN   VV    VV  CC    
;        NN NN  NN   VV    VV  CC 
;        NN  NN NN    VV  VV   CC     
;        NN   NNNN     VVVV    CC    
;        NN    NNN      VV     CC     CC
;       NNNN   NNNN     VV      CCCCCCC
;**********************************************************
	    NAME	DCLNVC
;----------------------------------------------------------
	    BegStn	NVC
;==========================================================
;	    класс: 1,	участки удаления/приближения
;==========================================================
	    Public	UpNVC
;----------------------------------------------------------
UpNVC:  Cls Up
;
up1n:	DclUp	<уп1н..>,<up2n,Ksn>
up2n:	DclUp	<уп2н..>,<?,up1n>
;
uu1t:	DclUp	<уу1ч..>,<uu2t,Ksnn>
uu2t:	DclUp	<уу2ч..>,<?,uu1t>
;
uu1n:	DclUp	<уу1н..>,<Kstn,?>
uu2n:	DclUp	<уу2н..>,<?,?>
;
up1t:	DclUp	<уп1ч..>,<Kst,?>
up2t:	DclUp	<уп2ч..>,<?,?>
;-----------------------------------------------
Kt1n:   DclUp   <кт1н..>,<?,?>
Kt3n:   DclUp   <кт3н..>,<?,?>
Kt5n:   DclUp   <кт5н..>,<?,?>
;-----------------------------------------------
Kt2n:   DclUp   <кт2н..>,<?,?>
Kt4n:   DclUp   <кт4н..>,<?,?>
Kt6n:   DclUp   <кт6н..>,<?,?>
;===============================================
;*	    класс: 2,	светофоры
;===============================================
		Public	KsNVC
KsNVC:	Cls	Ks
;-----------------------------------------------
Kst:	DclKs	<ч.....>,Svt,<Sptp,up1t>
Kstn:   Dclks   <чн....>,Svt,<Sptnp,uu1n>
Kst1:	DclKs	<ч1....>,Svt,<Sp1923,Kp1a>
Kst1p:	DclKs	<ч1п...>,Svt,<?,?>
Kst2:   DclKs   <ч2....>,Svt,<Sp1923,Kp2a>
Kst2p:  DclKs   <ч2п...>,Svt,<?,?>
Kst4:   DclKs   <ч4....>,Svt,<Sp1521,Kp4>
Kst25:  DclKs   <ч25...>,Svt,<Sp1sb,?>
;-----------------------------------------------
Ksn:	DclKs	<н.....>,Svn,<up1n,Spnp>
Ksnn:   DclKs   <нн....>,Svn,<uu1t,Spnnp>
Ksn1:   DclKs   <н1....>,Svn,<Sp24,Sp0610>
Ksn1p:	DclKs	<н1п...>,Svn,<?,?>
Ksn3:	DclKs	<н3....>,Svn,<Kp3b,Sp0816>
Ksn3p:	DclKs	<н3п...>,Svn,<?,?>
Ksnm4:	DclKs	<нм4...>,Svn,<Kp4,Sp1826>
Ksng:	DclKs	<нг....>,Svn,<Sp1618p,Sp0816>
Ksnm6:	DclKs	<нм6...>,Svn,<?,Sp1826>
;-----------------------------------------------
Ksm6:   DclKs   <м6....>,Svtm,<Sp02,Sptnp>
Ksm8:   DclKs   <м8....>,Svtm,<Sp0610,Sp04>
Ksm10:  DclKs   <м10...>,Svtm,<Sp0816,Sp02>
Ksm12:  DclKs   <м12...>,Svtm,<Sp22,?>   
Ksm14:  DclKs   <м14...>,Svnm,<Kp2b,Sp0610>
Ksm16:  DclKs   <м16...>,Svnm,<?,Sp1228>   
Ksm18:  DclKs   <м18...>,Svnm,<Kp1b,Sp24> 
Ksm22:  DclKs   <м22...>,Svtm,<Sp1826,Sp1618p> 
Ksm24:  DclKs   <м24...>,Svtm,<Sp1228,Kp1b> 
Ksm26:  DclKs   <м26...>,Svnm,<Kp1a,Sp1228> 
;-----------------------------------------------
Ksm1:   DclKs   <м1....>,Svnm,<sp18p,Sp05> 
Ksm3:   DclKs   <м3....>,Svnm,<Spnnp,Sp0113> 
Ksm5:   DclKs   <м5....>,Svnm,<Spnp,Sp0311>
Ksm7:   DclKs   <м7....>,Svnm,<Sp07,Sp1923>
Ksm9:   DclKs   <м9....>,Svnm,<Sp09,Sp1521>
Ksm11:  DclKs   <м11...>,Svtm,<Sp09,Kp3a>
Ksm13:  DclKs   <м13...>,Svtm,<Sp27,?> 
Ksm15:  DclKs   <м15...>,Svnm,<?,Sp31>   
Ksm17:  DclKs   <м17...>,Svtm,<Sp23a,?>
Ksm19:  DclKs   <м19...>,Svtm,<Sp35,?> 
Ksm21:  DclKs   <м21...>,Svtm,<Sp31,?>   
Ksm23:  DclKs   <м23...>,Svnm,<Sp0311,Sp09>   
;*==============================================
;*	    класс: 3,	пути
;===============================================
		Public	KpNVC
KpNVC:  Cls Kp
;-----------------------------------------------
Kp1a:	DclKp	<1а....>,<Kst1,Ksm26>
Kp1b:	DclKp	<1б....>,<Ksm24,Ksm18>
Kp2a:   DclKp   <2а....>,<Kst2,Kp2b>
Kp2b:   DclKp   <2б....>,<Kp2a,ksm14>
Kp3a:	DclKp	<3а....>,<Ksm11,Kp3b>
Kp3b:	DclKp	<3б....>,<Kp3a,Ksn3>
Kp4:    DclKp   <4.....>,<Kst4,Ksnm4>
;===============================================
;*	    класс: 4,	стрелки
;===============================================
		Public	StNVC
StNVC:	Cls	St
;-----------------------------------------------
St0204: DclSt   <002004>,<Sp02,Sp04>
St0608: DclSt   <006008>,<Sp0610,Sp0816>
St10:   DclSt   <010...>,<Sp0610>
St16:   DclSt   <016...>,<Sp0816>
St1826: DclSt   <018026>,<Sp1826>
St2224: DclSt   <022024>,<Sp24,Sp22>
St1228: DclSt   <012028>,<Sp1228>
;-----------------------------------------------
St1sb:  DclSt   <1сб...>,<Sp1sb>
St0103: DclSt   <001003>,<Sp0113,Sp0311>
St0507: DclSt   <005007>,<Sp05,Sp07>
St09:   DclSt   <009...>,<Sp09>
St1113: DclSt   <011013>,<Sp0311,Sp0113>
St15:   DclSt   <015...>,<Sp1521>       
St19:   DclSt   <019...>,<Sp1923>
St2127: DclSt   <021027>,<Sp1521,Sp27>       
St2323a:DclSt   <02323а>,<Sp1923,Sp23a>
St2931: DclSt   <029031>,<Sp31,Sp2933>
St3335: DclSt   <033035>,<Sp2933,Sp35>
;===============================================
;*	    класс: 5,	стрелочные секции
;===============================================
		Public	SpNVC
SpNVC:	Cls	Sp
;-----------------------------------------------
Sptp:   DclSp   <чп....>
		OFF     <Sp04>
        OFF     <Kst> 
Sptnp:  DclSp   <чнп...>
		OFF     <Ksm6>
        OFF     <Kstn> 
Sp02:   DclSp   <002...>,<St0204>
		OFF     <Ksm10,Sp04>
		OFF     <Ksm6,Ksm6>          
Sp04:  	DclSp   <004...>,<St0204>   
	    OFF	    <Ksm8,Ksm8>          
	    OFF	    <Sptp,Sp02>              
Sp0610:	DclSp   <006010>,<St0608,St10>
	    OFF	    <Ksm14,Ksn1,Sp0816,Sp0816>
	    OFF	    <Ksm8,Ksm8,Ksm8,Ksm8>
Sp0816:	DclSp   <008016>,<St16,St0608>
	    OFF	    <Ksn3,Ksn3,Ksng,Ksng>
	    OFF	    <Ksm10,Sp0610,Ksm10,Sp0610>
Sp1228:	DclSp   <012028>,<St1228>
	    OFF	    <ksm26,ksm16>
	    OFF	    <ksm24,ksm24>
Sp1826:	DclSp   <018026>,<St1826>
	    OFF	    <Ksnm4,Ksnm6>
	    OFF	    <Ksm22,Ksm22>
Sp1618p:DclSp   <01618п>
	    OFF	    <ksm22>
	    OFF	    <ksng>
Sp18p: 	DclSp   <18п...>
	    OFF	    <?>
	    OFF	    <ksm1>  
Sp22:  	DclSp   <022...>,<St2224>
	    OFF	    <?,sp24>
	    OFF	    <Ksm12,Ksm12>  
Sp24:  	DclSp   <024...>,<St2224>
	    OFF	    <Ksm18,Ksm18>
	    OFF	    <Ksn1,Sp22>  
;-----------------------------------------------		
Spnp:   DclSp   <нп....>
        OFF     <Ksn> 
		OFF     <Ksm5>
Spnnp:  DclSp   <ннп...>
        OFF     <Ksnn> 
		OFF     <Ksm3>
Sp0113: DclSp   <001013>,<St0103,St1113>
        OFF     <Ksm3,Sp0311,Ksm3,Sp0311>
		OFF     <Sp07,Sp07,Sp0311,Sp0311>
Sp0311: DclSp   <003011>,<St0103,St1113>
        OFF     <ksm5,Ksm5,Sp0113,Sp0113>
		OFF     <ksm23,Sp0113,ksm23,Sp0113>
Sp05:   DclSp   <005...>,<St0507>
        OFF     <Ksm1,Ksm1>
		OFF     <?,Sp07>
Sp07:   DclSp   <007...>,<St0507>
        OFF     <Sp0113,Sp05>
		OFF     <Ksm7,Ksm7>
Sp09:   DclSp   <009...>,<St09>
        OFF     <ksm23,ksm23>
		OFF     <ksm11,ksm9>
Sp1521: DclSp   <015021>,<St15,St2127>
        OFF     <ksm9,ksm9,ksm9,ksm9>
		OFF     <Sp2933,Sp27,kst4,kst4>
Sp27:   DclSp   <027...>,<St2127>
        OFF     <?,Sp1521>
        OFF     <ksm13,ksm13>
Sp2933: DclSp   <029033>,<St2931,St3335>
        OFF     <Sp1521,Sp1521,Sp1521,Sp1521>
    	OFF     <Sp1sb,Sp35,Sp31,Sp31>
Sp35:   DclSp   <035...>,<St3335>
        OFF     <?,Sp2933>
		OFF     <ksm19,ksm19>
Sp1sb:  DclSp   <1сб...>,<St1sb>
        OFF     <?,Sp2933>
		OFF     <kst25,kst25>
Sp31:   DclSp   <031...>,<St2931>   
        OFF     <Ksm15,Sp2933>       
		OFF     <Ksm21,Ksm21>          
Sp1923: DclSp   <019023>,<St19,St2323a>   
        OFF     <Ksm7,Ksm7,Ksm7,Ksm7>       
		OFF     <Kst2,Kst2,Kst1,Sp23a>          
Sp23a:  DclSp   <23а...>,<St2323a>   
        OFF     <?,Sp1923>       
		OFF     <Ksm17,Ksm17>          		
;-----------------------------------------------
;       перегоны
;-----------------------------------------------
;PgNVC:   CLS     Pg
;-----------------------------------------------
;np:      DclPg   <нп....>,<up1n,up2n>  ; перегон от св.Н
;tp:      DclPg   <чп....>,<up1t,up2t>  ; перегон от св.Ч
;--------------------------------------------------
;       переезды  
;--------------------------------------------------
PrNVC:   CLS     Pr
;--------------------------------------------------
pr1:     DclPr   <пр1...>
;**************************************************
;*	     Класс двухпозиционных объектов
;**************************************************
	     Public	DpNVC
DpNVC:	Cls	DP
;--------------------------------------------------
K1la:   DclDp   <1ла...> ;Столбец 1
K2la:   DclDp   <2ла...>
K3la:   DclDp   <3ла...>
K4la:   DclDp   <4ла...>
K5la:   DclDp   <5ла...>
K6la:   DclDp   <6ла...>
Knma:   DclDp   <нма...>
Ktma:   DclDp   <чма...>
Kog:    DclDp   <ог....>
Kwz:    DclDp   <вз....>,<01h,2Bh,"Отм взреза   ">,<04h,4Fh,"Взрез стрелки">
Krb:    DclDp   <крб...>
Kwu:    DclDp   <ву....>
Ktm:     DclDp   <чм....>
Kt:      DclDp   <ч.....>
Knm:     DclDp   <нм....> 
n:       DclDp   <н.....>
;-------------------------------------------------
Ktas:   DclDp   <ча....> ;Столбец 2
Knas:   DclDp   <на....>
Knkg:   DclDp   <нкж...> 
Ktkg:   DclDp   <чкж...> 
Kdsn:   DclDp   <дсн...> 
;-------------------------------------------------
Ksg:    DclDp   <сг....> ;Столбец 6  Включение заградительных сигналов поезду на переезде 
;-------------------------------------------------
Kpa:    DclDp   <кпа...> ;Столбец 7 
Knso:   DclDp   <нсо...> 
Ktso:   DclDp   <чсо...>
Kmg:    DclDp   <кмг...>
Kkiz:   DclDp   <из....>
;-------------------------------------------------
Ksz:    DclDp   <сз....>
;-------------------------------------------------
Km:     DclDp   <км....> ;Столбец 11
Kdn:    DclDp   <дн....>
Knot:   DclDp   <ноч...>
dsn:    DclDp   <дсн...>
Kpp:    DclDp   <кпп...>,<01h,2Bh,"ПредохрВНорме">,<04h,4Fh,"Перег предохр">
;-------------------------------------------------
Kf1k:   DclDp   <ф1к...>,<01h,2Bh,"Фидер 1 норма">,<04h,4Fh,"Нет 1 Фидера "> ;Столбец 12
Kf1b:   DclDp   <ф1б...>
Kf2k:   DclDp   <ф2к...>,<01h,2Bh,"Фидер 2 норма">,<04h,4Fh,"Нет 2 Фидера ">
Kf2b:   DclDp   <ф2б...>
Kos:    DclDp   <ос....>
Kom:    DclDp   <ом....>
Kop:    DclDp   <оп....>
Kgir:   DclDp   <гри...>
Kp:     DclDP   <кп....>
;-------------------------------------------------
Krs:    DclDp   <рс....> ;Столбец 13
Kgs:    DclDp   <гс....>
Kapn:   DclDp   <апн...>
;-------------------------------------------------
Kndisk: DclDp   <ндиск.>,<81h,2Bh,"ОтмНечет ТРВ ">,<84h,4Fh,"Нечет  ТРВ   "> ;Столбец 14
Kr1n:   DclDp   <кр1н..>
Ktdisk: DclDp   <чдиск.>,<81h,2Bh,"Отм Чет ТРВ  ">,<84h,4Fh,"Чет  ТРВ     ">            
Kr1t:   DclDp   <кр1ч..>
;------------------------------------------------
Kugpa:  DclDp   <югпа..> ;блок ЮГПА-ПИ
;************************************************
;       Описание сложных объектов
;************************************************
SoNVC:  Cls SO
;------------------------------------------------
Ktza:   So_Rept <чза...>,<St0204+Os,St0608+Os,St10+Os,St16+Os,St1826+Os,St2224+Os>
Knza:   So_Rept <нза...>,<St0103+OS,St0507+Os,St09+Os,St1113+Os,St15+Os,St19+Os,Fnza>
Fnza:	So_Rept <......>,<St2127+Os,St2323a+Os,St2931+Os,St3335+Os>
;------------------------------------------------
Kpin:   So_Fun  <ин....>,<Fizv>
Kpit:   So_Fun  <ич....>,<Fizv>
Fizv:   So_And  <изв...>,<Kpin+Tak,Kpit+Tak>,<-Pr1>
;------------------------------------------------
Fs1527: So_Fun	<сп1527>,<Fs27>,<Sp1521>
Fs27:	So_And	<......>,<Fs1527+Tps,St15+Tpk,St2127+Tmk>,<-Sp27>

Fz1527: So_Fun  <зс1527>,<Fzs27>,<-Sp1521+Zs>
Fzs27:	So_And	<......>,<Fz1527+Tps,St15+Tpk,St2127+Tmk>,<Sp27+Zs>

Fi1527: So_Fun  <ир1527>,<Fis27>,<Sp1521+Ir>
Fis27:  So_And  <......>,<Fi1527+Tak,St15+Tpk,St2127+Tmk>,<Sp27+Ir>

Fs2935: So_Fun  <сп2935>,<Fs35>,<Sp2933,Fs1sb>
Fs35:   So_And  <......>,<Fs2935+Tps,St2931+Tpk,St3335+Tmk>,<-Sp35>
Fs1sb:  So_And  <......>,<Fs2935+Tps,St2931+Tpk,St3335+Tpk>,<-Sp1sb>

Fz2935: So_Fun  <зс2935>,<Fzs35,Fzs1sb>,<-Sp2933+Zs>
Fzs35:  So_And  <......>,<Fz2935+Tps,St2931+Tpk,St3335+Tmk>,<Sp35+Zs>
Fzs1sb: So_And  <......>,<Fz2935+Tps,St2931+Tpk,St3335+Tpk>,<Sp1sb+Zs>

Fi2935: So_Fun  <ир2935>,<Fis35,Fis1sb>,<Sp2933+Ir>
Fis35:  So_And  <......>,<Fi2935+Tak,St2931+Tpk,St3335+Tmk>,<Sp35+Ir>
Fis1sb: So_And  <......>,<Fi2935+Tak,St2931+Tpk,St3335+Tpk>,<Sp1sb+Ir>
;------------------------------------------------
; Добавление стрелки 23а
;------------------------------------------------
Fs1923: So_Fun  <сп1923>,<Fs23a>,<Sp1923>
Fs23a:  So_And  <......>,<Fs1923+Tps,St2323a+Tmk,St19+Tmk>,<-Sp23a>

Fz1923: So_Fun  <зс1923>,<Fzs23a>,<-Sp1923+Zs>
Fzs23a: So_And  <......>,<Fz1923+Tps,St2323a+Tmk,St19+Tmk>,<Sp23a+Zs>

Fi1923: So_Fun  <ир1923>,<Fis23a>,<Sp1923+Ir>
Fis23a: So_And  <......>,<Fi1923+Tak,St2323a+Tmk,St19+Tmk>,<Sp23a+Ir>
;------------------------------------------------
k3p:	So_Rept	<к3п...>,<kp3a,kp3b>
k2p:	So_Rept	<к2п...>,<kp2b,kp2a>
k2ni:	So_Rept	<к2ни..>,<-kp2b+zpn,-kp2a+zpn>
k2ti:	So_Rept	<к2чи..>,<-kp2b+zpt,-kp2a+zpt>
k3ni:	So_Rept	<к3ни..>,<-kp3a+zpn,-kp3b+zpn>
k3ti:	So_Rept	<к3чи..>,<-kp3a+zpt,-kp3b+zpt>
;------------------------------------------------
Ktkz:   So_Fun  <чкз...>,<Ft1,Ft2,Ft4,Ft25>
Ft1:    So_And  <ч1зн..>,<Ktkz+Tak,Kst1+Tak>,<-Kst1+Go>
Ft2:    So_And  <ч2зн..>,<Ktkz+Tak,Kst2+Tak>,<-Kst2+Go>
Ft4:    So_And  <ч4зн..>,<Ktkz+Tak,Kst4+Tak>,<-Kst4+Go>
;Ft5:    So_And  <ч5зн..>,<Ktkz+Tak,Kst5+Tak>,<Kst5+Go>
Ft25:   So_And  <ч25зн.>,<Ktkz+Tak,Kst25+Tak>,<-Kst25+Go>
;------------------------------------------------
Knkz:   So_Fun  <нкз...>,<Fn1,Fn3,Fn4,Fn6>
Fn1:    So_And  <н1зн..>,<Knkz+Tak,Ksn1+Tak>,<-Ksn1+Go>
Fn3:    So_And  <н3зн..>,<Knkz+Tak,Ksn3+Tak>,<-Ksn3+Go>
Fn4:    So_And  <н4зн..>,<Knkz+Tak,Ksnm4+Tak>,<-Ksnm4+Go>
Fn6:    So_And  <н6зн..>,<Knkz+Tak,Ksnm6+Tak>,<-Ksnm6+Go>
;------------------------------------------------
;K3335pk: So_Fun <3335пк>,<F3335pk>
;K3335mk: So_Fun <3335мк>,<F3335mk>
;F3335pk: So_And <......>,<K3335pk+Tak,K3335mk+Tps>,<-St33+pk,-St35+pk>
;F3335mk: So_And <......>,<K3335mk+Tak,K3335pk+Tps>,<-St33+mk,-St35+mk>
;------------------------------------------------
;K2127pk: So_Fun <2127пк>,<F2127pk>
;K2127mk: So_Fun <2127мк>,<F2127mk>
;F2127pk: So_And <......>,<K2127pk+Tak,K2127mk+Tps>,<-St21+pk,-St27+pk>
;F2127mk: So_And <......>,<K2127mk+Tak,K2127pk+Tps>,<-St21+mk,-St27+mk>
;------------------------------------------------
;************************************************
;* Список групп сигналов ТС
;************************************************
	    BegGr	NVC
	    Stb	1
GR00:	Gr	<St0204+Pk,St0204+Mk,St0608+Pk,St10+Pk,St16+Pk,St16+Mk,St2224+Mk,-K5la>
GR01:	Gr	<Kp1a,K3p,?,Sp0610,Sp0816,Sp1826,Sp22,-K6la>
GR02:   Gr  <-Sp0610+Zs,-Sp1826+Zs,-Sp22+Zs,-Sp24+Zs,?,?,?,?>
;
	    Stb	2
GR03:	Gr	<St0103+Pk,St0103+Mk,St0507+Pk,St0507+Mk,St09+Pk,St1113+Pk,St19+Pk,St19+Mk>
GR04:	Gr	<St2931+Pk,St2931+Mk,Spnp,Spnnp,Sp0113,Sp0311,Sp05,Sp07>
GR05:	Gr	<Fs1923,Fs1527,Fs2935,-Sp0311+Zs,?,?,?,?>
;
	    Stb	3
GR06:	Gr	<Ksn+Ps,Ksn3+Ps,Ksnm4+Ps,Kst1+Ps,Kst2+Ps,Kst+Ps,-K1la,-K3la>
GR07:	Gr	<-K2la,-K4la,-Knma,-Ktma,-Kog,-Kwz,-Krb,Kwu>
GR08:   Gr  <Ktm,Kt,Knm,n,?,?,?,?>
;
	    Stb	4
GR09:	Gr	<Ktas,Knas,Ksn1,Ksn3,Kst1,Kst2,up1n,up2n>
GR0A:	Gr	<up1t,up2t,-Knkg,-Ktkg,uu2n,Kst1p,Kst2p,Ksn3p>
GR0B:	Gr	<Sptp,Sptnp,?,Sp02,?,?,?,?>
;
	    Stb	5
GR0C:	Gr	<Sp04,-Sptp+Zs,?,-Sp0816+Zs,?,St1sb+AVb,St1sb+AVk,?>
GR0D:   Gr	<dsn,?,-Sp0113+Zs,-Sp05+Zs,?,k2ni,k2ti,k3ni>
GR0E:	Gr	<k3ti,-kp4+zpn,?,?,?,?,?,?>
;
	    Stb	6
GR0F:	Gr	<Sp24,Ksn,Kst,Ksnm4,Ksnm6,?,St1sb+Pk,St1sb+Mk>
GR10:   Gr	<-Kp1a+Zpn,-Kp1a+Zpt,?,?,?,-ksg,-Kp4+Zpt,?>
GR11:	Gr	<?,uu1n,uu1t,?,?,?,?,?>
;
	    Stb	7
GR12:	Gr	<Fz2935,-Sp31+Zs,Knso,Ktso,-Spnnp+Zs,Ktkz,Knkz,Knza>
GR13:   Gr	<Ktza,-Spnp+Zs,Ksn+Ro,?,Kst+Ro,?,Kpa,-Ksn+Go>
GR14:	Gr	<-Kst+Go,Kp4,-Kmg,-Kkiz,?,?,?,?>
;
	    Stb	8
GR15:	Gr	<St0608+Mk,St10+Mk,St1826+Pk,St1826+Mk,?,?,St2224+Pk,?>
GR16:   Gr	<?,St09+Mk,St1113+Mk,St15+Pk,St15+Mk,?,?,St2127+Pk>
GR17:	Gr	<St2127+Mk,St2323a+Pk,St2323a+Mk,Kst4,?,?,?,?>
;
	    Stb	9
GR18:	Gr	<St3335+Pk,St3335+Mk,Sp31,K2p,-Sp02+Zs,-Sp04+Zs,Fz1527,Fz1923>
GR19:   Gr	<-sptnp+zs,?,Kt1n,Kt2n,Kt3n,Kt4n,Kt5n,Kt6n>
GR1A:	Gr	<sp18p,Ksnn,Kstn,Kst25,?,?,?,?>
;
	    Stb	10
GR1B:	Gr	<Ksn1+Ms+Rom,Ksn3+Ms+Rom,Ksnm4+Ms+Rom,?,Ksnm6+Ms+Rom,Kst1+Ms+Rom,Kst2+Ms+Rom,Kst4+Ms+Rom>
GR1C:   Gr	<?,Kst25+Ms+Rom,Ksm6+Rom,Ksm8+Rom,Ksm10+Rom,Ksm12+Rom,Ksm14+Rom,Ksm16+Rom>
GR1D:	Gr	<Ksm18+Rom,?,?,Ksz+sost3m,?,?,?,?>
;
	    Stb	11
GR1E:	Gr	<Ksm1+Rom,Ksm3+Rom,Ksm5+Rom,Ksm7+Rom,Ksm9+Rom,Ksm11+Rom,Ksm13+Rom,Ksm15+Rom>
GR1F:   Gr	<Ksm17+Rom,Ksm19+Rom,Ksm21+Rom,Km,knot,Kdn,Kdsn,Kpp>
GR20:   Gr	<?,?,?,?,?,?,?,?>
;
	    Stb	12
GR21:	Gr	<Kf1k,Kf1b,Kf2k,Kf2b,?,Kos,Kom,Kop>
GR22:   Gr	<Kgir,Kp,Sp0113+Ir,Sp0311+Ir,Sp05+Ir,Sp07+Ir,Fi1923,Fi1527>
GR23:	Gr	<Fi2935,Sp31+Ir,Sptnp+Ir,Sp02+Ir,?,?,?,?>
;
	    Stb	13
GR24:	Gr	<Sp04+Ir,Sp0610+Ir,Sp0816+Ir,Sp22+Ir,Sp1826+Ir,?,?,Spnnp+Ir>
GR25:   Gr	<Spnp+Ir,Sptp+Ir,?,uu2t,Krs,Kgs,Sp24+Ir,Kapn>
GR26:	Gr	<?,?,?,?,?,?,?,?>
;
	    Stb	14
GR27:	Gr	<Kndisk,?,-Kr1n,?,?,Ktdisk,?,-Kr1t>
GR28:	Gr	<Ksng,-ksng+av,ksng+ps,-sp07+zs,?,?,?,Kpin>
GR29:	Gr	<Kpit,-pr1+PrAlrm,?,?,?,?,?,?>
;
	    Stb	15
GR2A:	Gr	<ksm22+rom,ksm24+rom,ksm26+rom,ksm23+rom,ksng+ms+rom,St1228+pk,St1228+mk,Sp1228>
GR2B:	Gr	<-Sp1228+zs,Sp1228+Ir,sp09,-sp09+zs,sp09+ir,Kp1b,-Kp1b+zpn,-Kp1b+zpt>
GR2C:	Gr	<Sp1618p,-Sp1618p+zs,Sp1618p+Ir,Ksn1p,?,?,?,?>
;
	    Stb	16
GR2D:	Gr	<kugpa,?,?,?,?,?,?,?>
GR2E:	Gr	<?,?,?,?,?,?,?,?>
GR2F:	Gr	<?,?,?,?,?,?,?,?>

;--------------------------------------------------
	EndGr	NVC
;--------------------------------------------------
;       Описание блоков РКП-ТС
;--------------------------------------------------
		BegTS NVC
;-----------------------------------------------------------------------------------
TS1:	BLKTS 01,'14-143  '
			GRPTS <'2/4ПК     ','2/4МК     ','6/8ПК     ','10ПК      ','16ПК      '>
			GRPTS <'16МК      ','22/24МК   ','5ЛА       ','1АП       ','3П        '>
			GRPTS <'          ','6-10СП    ','8-16СП    ','18-20СП   ','22СП      '>
			GRPTS <'6ЛА       ','6-10З     ','18-20З    ','22З       ','24З       '>
;-----------------------------------------------------------------------------------
TS2:	BLKTS 02,'15-137  '
			GRPTS <'1/3ПК     ','1/3МК     ','5/7ПК     ','5/7МК     ','9ПК       '>
			GRPTS <'11/13ПК   ','19ПК      ','19МК      ','29/31ПК   ','29/31МК   '>
			GRPTS <'НП        ','ННП       ','1-13СП    ','3-11СП    ','5СП       '>
			GRPTS <'7СП       ','19-23СП   ','15-27СП   ','29-35СП   ','3-11З     '>
;-----------------------------------------------------------------------------------
TS3:	BLKTS 03,'11-064  '
			GRPTS <'НПС       ','Н3ПС      ','НМ4ПС     ','Ч1ПС      ','Ч2ПС      '>
			GRPTS <'ЧПС       ','1ЛА       ','3ЛА       ','2ЛА       ','4ЛА       '>
			GRPTS <'НМА       ','ЧМА       ','ОГ        ','ВЗ        ','КРБ       '>
			GRPTS <'ВУ        ','ЧМ        ','ЧП        ','НМ        ','НП        '>
;-----------------------------------------------------------------------------------
TS4:	BLKTS 04,'16-024  '
			GRPTS <'ЧАС       ','НАС       ','Н1С       ','Н3С       ','Ч1С       '>
			GRPTS <'Ч2С       ','Н1П       ','Н2П       ','Ч1П       ','Ч2П       '>
			GRPTS <'НКЖ       ','ЧКЖ       ','Н2У       ','ПЧ1О      ','ПЧ2О      '>
			GRPTS <'ПН3О      ','ЧП        ','ЧНП       ','          ','2СП       '>
;-----------------------------------------------------------------------------------
TS5:	BLKTS 05,'16-025  '
			GRPTS <'4СП       ','ЧПЗ       ','          ','8-16З     ','          '>
			GRPTS <'1сбАВ-Б   ','1сбАВ-К   ','          ','КДСН      ','          '>
			GRPTS <'1-13З     ','5З        ','          ','2НИ       ','2ЧИ       '>
			GRPTS <'3НИ       ','3ЧИ       ','4НИ       ','          ','          '>
;-----------------------------------------------------------------------------------
TS6:	BLKTS 06,'42-028  '
			GRPTS <'24СП      ','НС        ','ЧС        ','НМ4С      ','НМ6С      '>
			GRPTS <'          ','1СБПК1dd  ','1СБМК     ','1АНИ      ','1АЧИ      '>
			GRPTS <'          ','          ','          ','          ','4ЧИ       '>
			GRPTS <'          ','          ','Н1У       ','Ч1У       ','          '>
;-----------------------------------------------------------------------------------
TS7:	BLKTS 07,'16-028  '
			GRPTS <'29-35З    ','31З       ','НСО       ','ЧСО       ','ННПЗ      '>
			GRPTS <'ЧКЗ       ','НКЗ       ','НЗС       ','ЧЗС       ','НПЗ       '>
			GRPTS <'НКО       ','          ','ЧОК       ','          ','КПА       '>
			GRPTS <'НЗ1ЖО     ','ЧЗ1ЖО     ','4П        ','МГ        ','ИЗ        '>
;-----------------------------------------------------------------------------------
TS8:	BLKTS 08,'42-131  '
			GRPTS <'6/8МК     ','10МК      ','18/26ПК   ','18/26МК   ','          '>
			GRPTS <'          ','22/24ПК   ','          ','          ','9МК       '>
			GRPTS <'11/13МК   ','15ПК      ','15МК      ','          ','          '>
			GRPTS <'21/27ПК   ','21/27МК   ','23/23АПК  ','23/23АМК  ','Ч4С       '>
;-----------------------------------------------------------------------------------
TS9:	BLKTS 09,'42-132  '
			GRPTS <'33/35ПК   ','33/35МК   ','31СП      ','2П        ','2З        '>
			GRPTS <'4З        ','15-27З    ','19-23З    ','ЧНПЗ      ','          '>
			GRPTS <'КТ1Н      ','КТ2Н      ','КТ3Н      ','КТ4Н      ','КТ5Н      '>
			GRPTS <'КТ6Н      ','18П       ','ННС       ','ЧНС       ','Ч25С      '>
;-----------------------------------------------------------------------------------
TS10:	BLKTS 10,'42-133  '
			GRPTS <'Н1МС      ','Н3МС      ','НМ4МС     ','          ','НМ6МС     '>
			GRPTS <'Ч1МС      ','Ч2МС      ','Ч4МС      ','          ','Ч25МС     '>
			GRPTS <'М6С       ','М8С       ','М10С      ','М12С      ','М14С      '>
			GRPTS <'М16С      ','М18С      ','          ','          ','СЗ        '>
;-----------------------------------------------------------------------------------
TS11:	BLKTS 11,'42-134  '
			GRPTS <'М1С       ','М3С       ','М5С       ','М7С       ','М9С       '>
			GRPTS <'М11С      ','М13С      ','М15С      ','М17С      ','М19С      '>
			GRPTS <'М21С      ','КМ        ','КНОЧЬ     ','КДЕНЬ     ','ДСН       '>
			GRPTS <'КПП       ','          ','          ','          ','          '>
;-----------------------------------------------------------------------------------
TS12:	BLKTS 12,'42-135  '
			GRPTS <'Ф1К       ','Ф1Б       ','Ф2К       ','Ф2Б       ','          '>
			GRPTS <'ОС        ','ОМ        ','ОП        ','КГИР      ','КП        '>
			GRPTS <'1-13РИ    ','3-11РИ    ','5РИ       ','7РИ       ','19-23РИ   '>
			GRPTS <'15-27РИ   ','29-35РИ   ','31РИ      ','ЧНПРИ     ','2РИ       '>
;-----------------------------------------------------------------------------------
TS13:	BLKTS 13,'42-136  '
			GRPTS <'4РИ       ','6-10РИ    ','8-16РИ    ','22РИ      ','18-20РИ   '>
			GRPTS <'          ','          ','ННПРИ     ','НПРИ      ','ЧПРИ      '>
			GRPTS <'          ','Ч2У       ','КРС       ','КГС       ','24РИ      '>
			GRPTS <'АПН       ','          ','          ','          ','          '>
;-----------------------------------------------------------------------------------
TS14:	BLKTS 14,'42-152  '
			GRPTS <'НДИСК     ','          ','КР1Н      ','          ','          '>
			GRPTS <'ЧДИСК     ','          ','КР1Ч      ','НГС       ','НГИ       '>
			GRPTS <'НГПС      ','7З        ','          ','          ','          '>
			GRPTS <'НПИ       ','ЧПИ       ','КП        ','          ','          '>
;-----------------------------------------------------------------------------------
TS15:	BLKTS 15,'53-178  '
			GRPTS <'М22С(О)   ','М24С(О)   ','М26С(О)   ','М23С(О)   ','НГМС      '>
			GRPTS <'12/28ПК   ','12/28МК   ','12-28СП   ','12-28З    ','12-28РИ   '>
			GRPTS <'9СП       ','9З        ','9РИ       ','1БП       ','1БПНИ     '>
			GRPTS <'1БПЧИ     ','16/18П    ','16/18З    ','16/18РИ   ','ПН1 О     '>
;-----------------------------------------------------------------------------------
Ts16:	BlkTs 16,'16-23   '
			GrpTs <'ЮГПА-ПИ   ','          ','          ','          ','          '>
			GrpTs <'          ','          ','          ','          ','          '>
			GrpTs <'          ','          ','          ','          ','          '>
			GrpTs <'          ','          ','          ','          ','          '>
;-----------------------------------------------------------------------------------
			EndTs NVC
;--------------------------------------------------
;       Описание блоков РКП-ТУ
;--------------------------------------------------
        BegTU NVC 
;--------------------------------------------------
Tu1:    DclTu  01,'K1-421  ',<'        ','        ','        ','        ','        ','        ','        ','        '>
;--------------------------------------------------
        EndTU NVC
;--------------------------------------------------
	EndStn	NVC
	END
